[
  {
    "id": "1",
    "title": "Wanted Optometrist Assistant Lecturer",
    "company": "Vasthraa Institute of Science & Management",
    "logo": "https://picsum.photos/seed/vasthraa-logo/100/100",
    "location": "Sivakasi",
    "type": "Full-Time, Permanent, Fresher",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://in.indeed.com/viewjob?jk=b201b08db122a75f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "Applications are invited for the posts of Assistant Lecturer in the following disciplines from candidates possessing a First Class Master's Degree in the relevant subject Knowledge Fresher's also apply\n\nJob Types: Full-time, Permanent, Fresher\n\nPay: ₹15,000.00 - ₹30,000.00 per month\n\nWork Location: In person\n\nBase pay range\nThe minimum salary is ₹15K and the max salary is ₹30K.\n₹15K – ₹30K/mo (Employer provided)\n₹23K\n/mo Median"
  },
  {
    "id": "2",
    "title": "Senior Optometrist",
    "company": "Vasan Eye Care Hospital",
    "logo": "https://media.glassdoor.com/sql/523220/vasan-eye-care-squarelogo-1429607299898.png",
    "location": "Dharmapuri",
    "type": "Full-time, Permanent",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://www.glassdoor.co.in/Overview/Working-at-Vasan-Eye-Care-EI_IE523220.11,25.htm",
    "description": "Responsibilities include:\n\nPerforming comprehensive eye and vision tests\nDiagnosing defects of the eye, such as myopia, astigmatism and glaucoma\nPrescribing medications, eyeglasses and contact lenses\nJob brief\n\nWe are looking for an Optometrist to perform eye tests and provide excellent eye care to our patients.\n\nOptometrist responsibilities include analyzing vision tests, identifying sight problems and prescribing corrective lenses and eyeglasses. To be successful in this role, you should have attention to detail and be able to treat all kinds of patients with kindness and discretion, from young children to the elderly. Note that to be considered for this position, you need to be a licensed Optometrist.\n\nUltimately, you will ensure the accurate diagnosis and treatment of eye diseases and injuries.\n\nResponsibilities\n\nPerform comprehensive eye and vision tests\nDiagnose defects of the eye, such as myopia, astigmatism and glaucoma\nProvide personalized temporary and permanent solutions to sight issues based on each patient’s specific case and medical history\nPrescribe medications, eyeglasses and contact lenses\nAdvise patients on proper eye care techniques\nKeep updated and accurate medical records for all patients\nBook next appointments in cases where re-examination is required\nTrain patients on how to use and maintain their contact lenses\nRefer eye doctors and ophthalmologists when patients need to undergo a surgery or in cases of severe eye injuries\nRequirements and skills\n\nWork experience as an Optometrist\nIn-depth understanding of eye conditions and vision defects\nHands-on experience with eye examination tools, such as ophthalmoscope and tonometer\nThe ability to explain medical terms simply and calmly\nAttention to detail\nDegree in Optometry\nNeed to know couselling on Lasik\nExperience : 2 year[Min]\n\nLanguage known : Tamil and English\n\nPreferrence: Dharmapuri Candidates & if Others ready to relocate within 15 days.[ only senior who have more than 2+ years experience in the Optometry]\n\nNo accommodation\n\nJob Types: Full-time, Permanent\n\nPay: ₹20,000.00 - ₹22,000.00 per month\n\nBenefits:\n\nProvident Fund\nAbility to commute/relocate:\n\nDharmapuri, Tamil Nadu: Reliably commute or planning to relocate before starting work (Required)\nExperience:\n\ntotal work: 2 years (Required)\nWork Location: In person\n\n\nShow less\n\nBase pay range\nThe minimum salary is ₹20K and the max salary is ₹22K.\n₹20K – ₹22K/mo (Employer provided)\n₹21K\n/mo Median"
  },
  {
    "id": "3",
    "title": "Senior Optometrist Jobs in Lotus Eye Hospital and Institute - Tiruppur, Tamil Nadu",
    "company": "Lotus Eye Hospital and Institute",
    "logo": "https://silverlinktechnologies.com/wp-content/uploads/2021/07/lotus-eye-hospital.png",
    "location": "Tiruppur - Palladam Rd, opp. Sulochana Mills, TML Colony, Thennampalayam, Tiruppur, Tamil Nadu 641604, India",
    "type": "Full-Time",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://www.swaasa.com/in/en/job/P-129270/Senior-Optometrist-Jobs-in-Lotus-Eye-Hospital-and-Institute-Tiruppur-Tamil-Nadu?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "Lotus Eye Hospital and Institute is seeking a skilled and experienced Senior Optometrist to join our healthcare team in Tiruppur, Tamil Nadu. As a Senior Optometrist, you will play a vital role in delivering quality eye care services, performing vision assessments, prescribing corrective lenses, and educating patients. At Lotus Eye Hospital and Institute, we are committed to clinical excellence and compassionate patient care.\n\nResponsibilities:\n\nConduct comprehensive eye examinations and vision testing at Lotus Eye Hospital and Institute.\nPrescribe eyeglasses and contact lenses based on accurate diagnoses.\nEducate patients on eye health, visual hygiene, and treatment plans.\nProvide pre-operative and post-operative care for surgical patients.\nMaintain and manage accurate patient records and billing information.\nAssist in mentoring junior optometrists at Lotus Eye Hospital and Institute.\nCollaborate with ophthalmologists and other medical staff for holistic eye care.\n\nRequirements:\n\nBachelor’s degree in Optometry or equivalent qualification.\nMinimum of 5 years of professional experience in optometry.\nProficient in vision testing, lens fitting, and patient counseling.\nExcellent communication and interpersonal skills.\nStrong decision-making ability and attention to detail.\nAbility to work independently and within a team environment.\nFamiliarity with eye care equipment and EMR systems.\n\nBenefits:\n\nBe a part of a reputed institution like Lotus Eye Hospital and Institute.\nCompetitive salary and performance-based incentives.\nOpportunities for continuous learning and professional growth.\nCollaborative and patient-centric work environment at Lotus Eye Hospital and Institute.\nAccess to modern diagnostic tools and technologies."
  }
]