
[
  {
    "id": "1",
    "title": "Wanted Optometrist Assistant Lecturer",
    "company": "Vasthraa Institute of Science & Management",
    "logo": "https://picsum.photos/seed/vasthraa-logo/100/100",
    "location": "Sivakasi",
    "type": "Full-Time, Permanent, Fresher",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://in.indeed.com/viewjob?jk=b201b08db122a75f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "## :scroll: Job Description\n> Applications are invited for the posts of Assistant Lecturer in the following disciplines from candidates possessing a First Class Master's Degree in the relevant subject Knowledge Fresher's also apply\n\n### :briefcase: Job Details\n| Job Type | Pay | Work Location |\n| :--- | :--- | :--- |\n| Full-time, Permanent, Fresher | ₹15,000.00 - ₹30,000.00 per month | In person |\n\n### :moneybag: Salary Information\n| Minimum Salary | Maximum Salary | Median Salary |\n| :--- | :--- | :--- |\n| ₹15K | ₹30K | ₹23K/mo |"
  },
  {
    "id": "2",
    "title": "Senior Optometrist",
    "company": "Vasan Eye Care Hospital",
    "logo": "https://media.glassdoor.com/sql/523220/vasan-eye-care-squarelogo-1429607299898.png",
    "location": "Dharmapuri",
    "type": "Full-time, Permanent",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://www.glassdoor.co.in/Overview/Working-at-Vasan-Eye-Care-EI_IE523220.11,25.htm",
    "description": "## :scroll: Job Brief\n> We are looking for an Optometrist to perform eye tests and provide excellent eye care to our patients.\n\n### :clipboard: Responsibilities\n- :check: Perform comprehensive eye and vision tests\n- :check: Diagnose defects of the eye, such as myopia, astigmatism and glaucoma\n- :check: Provide personalized temporary and permanent solutions to sight issues based on each patient’s specific case and medical history\n- :check: Prescribe medications, eyeglasses and contact lenses\n- :check: Advise patients on proper eye care techniques\n- :check: Keep updated and accurate medical records for all patients\n- :check: Book next appointments in cases where re-examination is required\n- :check: Train patients on how to use and maintain their contact lenses\n- :check: Refer eye doctors and ophthalmologists when patients need to undergo a surgery or in cases of severe eye injuries\n\n### :white_check_mark: Requirements and skills\n- :check: Work experience as an Optometrist\n- :check: In-depth understanding of eye conditions and vision defects\n- :check: Hands-on experience with eye examination tools, such as ophthalmoscope and tonometer\n- :check: The ability to explain medical terms simply and calmly\n- :check: Attention to detail\n- :check: Degree in Optometry\n- :check: Need to know couselling on Lasik\n- :check: Experience : 2 year[Min]\n\n> **Language known :** Tamil and English\n> **Preferrence:** Dharmapuri Candidates & if Others ready to relocate within 15 days.[ only senior who have more than 2+ years experience in the Optometry]\n> **No accommodation**\n\n### :moneybag: Salary and Benefits\n| Job Type | Pay | Benefits |\n| :--- | :--- | :--- |\n| Full-time, Permanent | ₹20,000.00 - ₹22,000.00 per month | Provident Fund |\n\n### :truck: Commute/Relocation\n> Dharmapuri, Tamil Nadu: Reliably commute or planning to relocate before starting work (Required)\n\n### :briefcase: Experience\n> total work: 2 years (Required)"
  },
  {
    "id": "3",
    "title": "Senior Optometrist Jobs in Lotus Eye Hospital and Institute - Tiruppur, Tamil Nadu",
    "company": "Lotus Eye Hospital and Institute",
    "logo": "https://silverlinktechnologies.com/wp-content/uploads/2021/07/lotus-eye-hospital.png",
    "location": "Tiruppur - Palladam Rd, opp. Sulochana Mills, TML Colony, Thennampalayam, Tiruppur, Tamil Nadu 641604, India",
    "type": "Full-Time",
    "posted": "2025-11-12T12:00:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://www.swaasa.com/in/en/job/P-129270/Senior-Optometrist-Jobs-in-Lotus-Eye-Hospital-and-Institute-Tiruppur-Tamil-Nadu?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "## :scroll: Job Description\n> Lotus Eye Hospital and Institute is seeking a skilled and experienced Senior Optometrist to join our healthcare team in Tiruppur, Tamil Nadu. As a Senior Optometrist, you will play a vital role in delivering quality eye care services, performing vision assessments, prescribing corrective lenses, and educating patients. At Lotus Eye Hospital and Institute, we are committed to clinical excellence and compassionate patient care.\n\n### :clipboard: Responsibilities\n- :check: Conduct comprehensive eye examinations and vision testing at Lotus Eye Hospital and Institute.\n- :check: Prescribe eyeglasses and contact lenses based on accurate diagnoses.\n- :check: Educate patients on eye health, visual hygiene, and treatment plans.\n- :check: Provide pre-operative and post-operative care for surgical patients.\n- :check: Maintain and manage accurate patient records and billing information.\n- :check: Assist in mentoring junior optometrists at Lotus Eye Hospital and Institute.\n- :check: Collaborate with ophthalmologists and other medical staff for holistic eye care.\n\n### :white_check_mark: Requirements\n- :check: Bachelor’s degree in Optometry or equivalent qualification.\n- :check: Minimum of 5 years of professional experience in optometry.\n- :check: Proficient in vision testing, lens fitting, and patient counseling.\n- :check: Excellent communication and interpersonal skills.\n- :check: Strong decision-making ability and attention to detail.\n- :check: Ability to work independently and within a team environment.\n- :check: Familiarity with eye care equipment and EMR systems.\n\n### :gift: Benefits\n- :check: Be a part of a reputed institution like Lotus Eye Hospital and Institute.\n- :check: Competitive salary and performance-based incentives.\n- :check: Opportunities for continuous learning and professional growth.\n- :check: Collaborative and patient-centric work environment at Lotus Eye Hospital and Institute.\n- :check: Access to modern diagnostic tools and technologies."
  },
  {
    "id": "4",
    "title": "Optometrist",
    "company": "Titan Company Limited",
    "logo": "https://media.monsterindia.com/logos/xOP_titacomplimiinx/jdlogo.gif",
    "location": "Madurai, India",
    "type": "Full-time, On-site",
    "posted": "2025-11-14T00:05:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://www.foundit.in/seeker/single-page-registration?from=Adsolave_Digital_New&spl=IN_paid_job_boards_acq_affiliates_Adsolave_Digital_New_Feed&gd=1&jobid=130927107&action=apply&utm_campaign=IN_paid_job_boards_acq_affiliates_Adsolave_Digital_New_Feed&utm_medium=affiliates&utm_source=Adsolave_Digital_New&utm_source=jooble&utm_medium=cpc&utm_campaign=allvacancies",
    "description": "## :scroll: Job Description\n> This is a full-time on-site role for an Optometrist located in Madurai and ROTN. The Optometrist will be responsible for conducting thorough eye examinations, diagnosing vision problems and prescribing corrective spectacles and contact lenses and providing pre and post QC for lenses and contact lenses.\n\n### :white_check_mark: Qualifications\n- Degree or Diploma from an accredited institution\n- Strong diagnostic skills and the ability to interpret various eye tests\n- Proficiency in prescribing corrective lenses and other treatments\n- Excellent communication and interpersonal skills to interact with patients and colleagues\n- Attention to detail and strong organizational skills\n- Dispensing of contact lenses\n\n### :information_source: More Info\n| Industry | Function | Job Type |\n| :--- | :--- | :--- |\n| Other | Healthcare | Permanent Job |\n\n### :gear: Skills Required\n- Strong diagnostic skills\n- Dispensing of contact lenses\n- Proficiency in prescribing corrective lenses\n- Degree or Diploma from an accredited institution\n- Ability to interpret various eye tests\n\n### :office: About Company\n> Titan Company Limited"
  },
  {
    "id": "5",
    "title": "Optometrist",
    "company": "Ayaan Eye Hospital",
    "logo": "https://ayaaneyehospital.com/appassets/mediaassets/7b0d4c0e0fc84e88a234ed100b0d5b80/image/logo-1752230685124.png",
    "location": "Vijayawada, Andhra Pradesh",
    "type": "Full-time, On-site",
    "posted": "2025-11-14T00:20:00Z",
    "postedBy": "Admin",
    "applyUrl": "https://in.linkedin.com/jobs/view/optometrist-at-ayaan-eye-hospital-4320713914?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "## :scroll: Job Description\n> This is a full-time, on-site role for an Optometrist based in Vijayawada. The Optometrist will be responsible for performing comprehensive eye examinations, diagnosing and treating visual issues, prescribing corrective lenses, and providing pre-operative and post-operative care for patients undergoing surgeries. The role also involves educating patients about eye health and collaborating with other healthcare professionals to ensure optimal patient care.\n\n### :white_check_mark: Qualifications\n- Experience in conducting thorough eye examinations and prescribing corrective eyewear\n- Proficiency in diagnosing and managing eye diseases and conditions\n- Strong interpersonal skills for patient education and communication\n- Experience with pre-operative and post-operative eye care procedures\n- Attention to detail and a commitment to maintaining high standards in patient care\n- Ability to work effectively as part of a multidisciplinary team\n- Doctorate of Optometry (OD) or equivalent qualifications\n- Clinical experience in optometry practice is preferred"
  }
]
