[
  {
    "id": "1",
    "title": "Optometrist - Strathfield Eyecare",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Strathfield, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-strathfield-eyecare-at-provision-eyecare-4321902909?position=1&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=i10Ibu%2BHfJHIgvutgUEhOw%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Strathfield, NSW\n\nJoin a small, supportive team at Strathfield Eyecare, an independent, full-scope practice serving the community for over 21 years.\n\nShare dispensing duties while focusing on quality patient care in a collaborative environment.\n\n## What We’re Looking For\n* Passion for delivering exceptional eye care\n* Excellent communication and interpersonal skills\n* Interest or experience in myopia management & dry eye care\n* Korean-speaking skills a bonus, but not essential\n* Recent graduates welcome\n\n## What We Offer\n* Friendly, professional team of optometrists\n* State-of-the-art equipment: Myopia Master, Topographer, OCT, K5M, Envision IPL/RF, DNEye scanner\n* Support via the ProVision network\n* Generous salary with uncapped revenue-sharing\n* Flexible start date"
  },
  {
    "id": "2",
    "title": "Optometrist / Optyk (m/f/d) – Oportunitate de a-ți conduce propriul magazin - Germania",
    "company": "SuperVista AG",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFLN1yyR2bL0g/company-logo_100_100/company-logo_100_100/0/1644505367444/supervista_ag_logo?e=2147483647&v=beta&t=951vUxgZhBWyTxlWyPb27Apa3UNfjKJ-KF3RtFR6Xng",
    "location": "Athen, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-optyk-m-f-d-%E2%80%93-oportunitate-de-a-%C8%9Bi-conduce-propriul-magazin-germania-at-supervista-ag-4311481023?position=2&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=rExYjT8ofVIXhSlnj1EBjw%3D%3D",
    "description": "## About Us\n\n> Über Uns\n\nΗ SuperVista AG, με το brand brillen.de, προσφέρει μια μοναδική ευκαιρία σε άτομα με επιχειρηματικό πνεύμα, που είναι έτοιμα να ξεκινήσουν τη δραστηριότητά τους στη Γερμανία ως ανεξάρτητοι αδειούχοι – χωρίς απαιτούμενη ίδια κεφαλαιακή επένδυση.\n\n## The unique offer includes\n* Δοκιμαστική περίοδος: 6 μήνες για να δοκιμάσετε τη δραστηριότητά σας ως επιχειρηματίας.\n* Οικονομική ασφάλεια: Κατά τη διάρκεια της 6μηνης δοκιμαστικής περιόδου θα λαμβάνετε προμήθεια τουλάχιστον 35% από όλα τα έσοδα του καταστήματος. Από αυτήν την προμήθεια θα καλύπτετε τα έξοδα προσωπικού και ενοικίασης. Σας εγγυόμαστε ότι, μετά την αφαίρεση αυτών των εξόδων, θα σας απομένουν τουλάχιστον 3.000 ευρώ.\n* Υποστήριξη και εκπαίδευση: Πλήρη εκπαιδευτικά μαθήματα και συνεχής υποστήριξη για την ανάπτυξη των επιχειρηματικών δεξιοτήτων που απαιτούνται για την επιτυχία.\n* Υψηλής ποιότητας γυαλιά σχεδιαστών: Αυτόματα θα γίνετε και συνεργάτης των THE GOOD BRAND OPTICIANS, όπου θα πουλάτε γυαλιά σχεδιαστών υψηλής ποιότητας, στην μεσαία προς υψηλή κατηγορία τιμών, με προμήθεια 50%, χωρίς δικά σας έξοδα μάρκετινγκ ή αποθεμάτων. Μοναδικό concept στη Γερμανία.\n* Υποστήριξη για την απόκτηση άδειας εργασίας: Αν είναι απαραίτητο, θα λάβετε πλήρη υποστήριξη για την έκδοση βίζας ή άδειας εργασίας.\n\n## After the trial period\n* Μόνιμη ανάληψη: Σε περίπτωση αμοιβαίου ενδιαφέροντος και ικανοποίησης των προσδοκιών μας, μπορείτε να αναλάβετε το υποκατάστημα μόνιμα.\n* Ευνοϊκοί όροι: Μηνιαίο τέλος ανάληψης μόλις 600 ευρώ.\n\n## Your Advantages\n* Επιχειρηματική ελευθερία: Σχηματίστε το δικό σας μέλλον και αναλάβετε τον έλεγχο της δραστηριότητας του καταστήματος σας.\n* Υψηλότερα έσοδα: Επωφεληθείτε άμεσα από την επιτυχία σας μέσω ενός μοντέλου αμοιβής βασισμένου στην απόδοση.\n* Υποστήριξη για άδεια εργασίας: Προσφέρουμε βοήθεια σε καταρτισμένους υποψηφίους από το εξωτερικό για την απόκτηση της απαραίτητης άδειας εργασίας.\n\n## Your Opportunity\n* Υφιστάμενες επιχειρήσεις: Αναλάβετε άμεσα υφιστάμενες επιχειρήσεις με μεγάλη βάση πελατών.\n* Επαφή με πελάτες: Καθημερινά ραντεβού με πελάτες που ενδιαφέρονται να αγοράσουν τα γυαλιά μας.\n* Επιτυχία χωρίς κεφάλαιο: Απολαύστε πολύ καλά έσοδα χωρίς να χρησιμοποιήσετε δικό σας κεφάλαιο. Αυτό που απαιτούμε είναι η πλήρης δέσμευσή σας και η μέγιστη επιθυμία πώλησης."
  },
  {
    "id": "3",
    "title": "Optometrist | Toorak",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Toorak, Victoria, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-toorak-at-george-matilda-eyecare-4321983090?position=3&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=RbSefcxunGrVR%2B9yRY8G6Q%3D%3D",
    "description": "## Job Overview\n\n> Casual Optometrist | Toorak\n\nDo you want to take more time, more care, and get to know your patients better? Our team in Toorak are looking for a Casual Optometrist to embed themselves in the local community and continue their tradition of providing exceptional eyecare. Working alongside Ophthalmologist Dr Harry Unger and a highly regarded team, this role offers the chance to shape the patient experience at one of Melbourne’s most prestigious addresses.\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience to achieve goals, leading your team to greatness, then this role may be for you. We are searching for someone with the following skills:\n* Optometrist qualification with +2 years practical experience\n* Be able to use your optical knowledge and experience to communicate clearly with patients in a bright and friendly manner\n* Have a passion about putting the customer’s eye health first\n* A passion for optical style and fashion\n* Willing to keep up-to-date with industry developments\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level with the support of a proudly Australian organisation. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* A competitive annual salary package + super + OA + AHPRA + CPD Allowance\n* Earn extra cash every two weeks with a fortnightly bonus structure!\n* Continuing education and ongoing training and development\n* Free eye examinations, annual product allowance and family and friends’ discounts and benefits – because we care about the people you care about\n* Career progression and development with support from our Professional Services team\n* The chance to feel truly independent while having the additional support of our office functions\n\n## About The Business\nOur practice has a focus on comprehensive eye examinations, prescription sunglasses, spectacle frames, contact lenses, and eye health care for the whole family. At G&M Eyecare we believe that no two pairs of eyes are the same. Every individual has something unique to bring to their role, that’s why we encourage and support diversity in all its forms. At G&M Eyecare we are committed to making the environment you work in inclusive and enabling."
  },
  {
    "id": "4",
    "title": "Orthoptic Casual",
    "company": "NSW Health",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQEKPvnhHaPazQ/company-logo_100_100/B56ZYOdZytHoAQ-/0/1743999312688/nsw_health_logo?e=2147483647&v=beta&t=nPdR6j7VTGuRT3WxjwWUE7prCx7IhNmv0XaiZUen7HY",
    "location": "Randwick, New South Wales, Australia",
    "type": "Temporary",
    "applyUrl": "https://au.linkedin.com/jobs/view/orthoptic-casual-at-nsw-health-4251177741?position=4&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=QzBi07%2FCI60juSezGdo0bg%3D%3D",
    "description": "## Job Overview\n\n> Employment Type: Casual\n> Position Classification: Orthoptist Level 1/2\n> Remuneration: $37.03 - $52.83 per hour plus superannuation\n> Hours Per Week: Up to 38\n\n## The Role\nThis opportunity is to join our Prince of Wales Orthoptic casual pool. Orthoptists in our casual pool, pending their availability may be called upon at short notice or may be rostered in advance to cover shift vacancies. Orthoptists work part of a multidisciplinary team in the Eye Clinic at Prince of Wales Hospital to provide orthoptic and ophthalmic care to outpatients and inpatients.\n\n## What We Offer\n* Up to 12 allocated days off each year (for full-time employees) in addition to annual leave.\n* Salary packaging options that reduce your taxable income and increase your take-home pay! Up to $9K for living expenses and $2.6K meal & entertainment & Novated Leasing.\n* Discounted gym memberships with a Fitness Passport\n* Employee Assistance Program (EAP) for employees and family members.\n* Discounted Private Health Insurance.\n* Inner city location with direct access to eastern suburbs beaches, restaurants and transport links that are right at the front door\n\n## Selection Criteria\nTo be considered for this position, please ensure you address the below questions as thoroughly as possible.\n* Must hold a Diploma or bachelor of Applied Science (Orthoptics), Masters in Orthoptics or equivalent with eligibility for registration with the Orthoptic Board of Australia.\n* Demonstrated knowledge and experience in the investigation and managment of adult and paediatric patients with strabismus and ocular motility disorders within commensurate years of experience.\n* Demonstrated knowledge and ability in ophthalmic assisting including perimetry, OCT, Pentacam, refraction, ocular Biometry\n* Demonstrated high level written and verbal communication, and interpersonal skills\n* Demonstrated commitment to quality improvement and ability to translate evidence into practice.\n* Ability to work as part of a multi-disciplinary team and to exercise independent professional judgement on routine matters, commensurate with years of experience."
  },
  {
    "id": "5",
    "title": "Casual Optical Dispenser - Charlestown Eyecare",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Charlestown, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-charlestown-eyecare-at-george-matilda-eyecare-4322214912?position=5&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=trWvfRUqiVFD4G%2FfCtAKhw%3D%3D",
    "description": "## Job Overview\n\nNational Optical Care, are a community of optometry practices that are passionate about empowering eye care excellence. We recently merged with George and Matilda, leveraging the combined expertise of our practice community with strong supplier relationships to deliver the very best in patient care, creating opportunities for career development.\n\nWe are searching for a Casual Dispenser to grow our team.\n\n## About The Role\n* Provide friendly and efficient reception service\n* Assist patients in the selection of optical frames taking into account lifestyle and physical needs\n* Recommend use of ancillary products (e.g. contact lens care products).\n* Support other team members in the achievement of practice goals and objectives including (but not limited to) processing Medicare, health fund payments, credits / warranties, entering stock, jobs due report, debtor’s management and stock takes\n* Maintain a high level of housekeeping in the practice including overall presentation and cleanliness\n\n## Our Benefits\n* Learning and development opportunities tailored to your goals\n* Great discounts across frames and lenses including family and friends\n* Employee Assistance Program (EAP)\n* Perks and bonus Programs\n* Work with a great team who are truly invested in their patients\n\n## About You\n* Effective communication and customer service skills both in person and over the phone\n* Team focused alongside independent work\n* Strong organizational skills and ability to problem solve\n* Positive and energetic attitude\n* Experience in the optical industry is preferred, however for those eager to take on a new career we are willing to develop\n* With no weekend work or late nights"
  },
  {
    "id": "6",
    "title": "Optician",
    "company": "Clear Optometry Bargara",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQGws2izrVvHiw/company-logo_100_100/B56ZpIC5_OJsAQ-/0/1762145313982/clear_optometry_bargara_logo?e=2147483647&v=beta&t=EhTtw0FZ9e3MwB03x9ukgUZGBxzFHqA5tFEHAIaOGGg",
    "location": "Bundaberg, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optician-at-clear-optometry-bargara-4320189556?position=6&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=e44ioU1mHjd%2FQPfvfM6C%2Bw%3D%3D",
    "description": "## Job Overview\n\n> Optical Dispenser/Assistant\n> Location: Bargara, QLD\n> Work type: Full-time (part-time considered for the right person)\n\n## About Us\nClear Optometry is a friendly, independent optometry practice in beautiful beachside Bargara, QLD. We pride ourselves on integrity, attention to detail, and genuine patient care. Our small, supportive team works together to provide outstanding service in a relaxed, coastal setting.\n\n## About the Role\nWe're looking for an Optical Dispenser/Assistant to join our team. You'll play a key role in making every patient feel welcome and cared for — from helping with frame selection to supporting the optometrist in daily tasks.\n\nOptical experience is highly desirable but not essential for the right person — we're happy to provide training if you bring the right attitude.\n\n## You'll Be\n* Friendly, professional, and a real team player\n* Detail-focused and organised\n* Comfortable using computers and learning new systems\n* Flexible to help cover staff absences when needed\n* Interested in a long-term role, not just a short-term job\n\n## Why You'll Love It\n* Supportive, community-minded workplace\n* No evenings or weekends\n* Varied, rewarding role in a beautiful coastal town\n* Opportunity to grow your skills in a respected local practice"
  },
  {
    "id": "7",
    "title": "Optical Dispenser - Holdfast Bay Optometry",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Glenelg North, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-holdfast-bay-optometry-at-provision-eyecare-4317733723?position=7&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=JZH%2FOaTV1MSj6TO4jZHl4Q%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Glenelg, SA\n\nThis is an exciting opportunity to join Holdfast Bay Optometry, an independent practice that prides itself on providing quality eyecare and eyewear solutions to the Glenelg community and beyond.\n\n## About You\nYou’re someone who thrives on creating great customer experiences and enjoys being part of a small, connected team. You bring:\n* Previous experience in an optical or retail setting\n* Excellent communication and computer skills\n* A genuine interest in style and helping patients choose the perfect frame\n* Confidence to assist with social media posts and patient engagement\n* Strong attention to detail and a proactive approach to learning\n\n## The Role\nYou’ll be part of the full patient journey - from greeting clients and assisting with eyewear selection to supporting our optometrists and managing admin tasks.\n\n> Hours - Rotating Roster (23–26 hrs/week):\n> * Week 1 & 3: Monday 9-2 | Wednesday 9-5:30 | Friday 9-2 | Saturday 9-2\n> * Week 2: Monday-Friday 9-5:30 | Saturday 9-2\n\n## Why You’ll Love It Here\n* Independent and proudly local - you’re not just a number\n* Preventative eyecare focus - “we can see what you can’t!”\n* A loyal patient base who value quality and trust\n* Bespoke eyewear and premium lens solutions\n* Supportive, friendly team that genuinely listens"
  },
  {
    "id": "8",
    "title": "Optical Assistant/Dispenser - iVision Optometrists",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Leeming, Western Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-ivision-optometrists-at-provision-eyecare-4339917891?position=8&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=zJgrVOh%2B9Xj8zHrVAqY%2FWg%3D%3D",
    "description": "## Job Overview\n\n> Full and Part Time available - Leeming, WA\n\nAre you looking for a role that blends purpose, people, and genuine work-life balance? I-Vision Optometrists is seeking an experienced, people-focused Optical Assistant / Dispenser to join our friendly, independent team in Leeming. We currently have both full-time and part-time opportunities available, offering flexibility for the right candidates.\n\n## Why You’ll Love Working with Us\n* No late nights. No Sundays.\n* A team that values connection.\n* Learn, grow, and be supported.\n* Real autonomy, real trust.\n* A supportive environment.\n* Optional creative outlet.\n\n## What You’ll Be Doing\n* Helping patients choose frames and lenses that make them see and feel great\n* Managing orders, reception, and administrative tasks\n* Taking initiative and working independently when required\n\n## About You\n* You have optical dispensing or optical retail experience and are ready to take the next step\n* You’re motivated, reliable and thrive in a close-knit, positive team\n* You’re confident working independently and take pride in delivering great service\n* You’re available to start soon (flexible start dates available for the right candidates)\n\n## About I-Vision Optometrists\nFor over 15 years, we’ve proudly served the Leeming community with personalised, professional eyecare. We’re known for our warm, supportive culture where teamwork, trust and laughter are part of the daily routine."
  },
  {
    "id": "9",
    "title": "Optical Assistant/Dispenser - Pezzimenti Nixon Optometrists",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Hawthorn, Victoria, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-pezzimenti-nixon-optometrists-at-provision-eyecare-4319533979?position=9&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=zsf5JRXwJev6T9%2BShraRWw%3D%3D",
    "description": "## Job Overview\n\n> Flexible Hours - Hawthorn, VIC\n\nJoin a fun, friendly, and family oriented independent practice where everyone pitches in and supports each other. Pezzimenti Nixon Optometry provides exceptional eye care for the whole family, and we’re looking for a caring and motivated Optical Assistant or Dispenser to join our team.\n\n## What you’ll be doing\n* Providing outstanding customer service and helping patients feel at ease\n* Assisting across all areas of the practice – from reception to frame styling and lens advice\n* Supporting the team during annual or sick leave when possible\n* Keeping up to date with the latest eyewear trends and products\n\n## What we’re looking for\n* A warm communicator with a passion for helping people\n* Experience in retail, customer service, or medical reception (optical experience highly valued but not essential)\n* A collaborative team player who’s eager to learn and grow\n\n## What’s on offer\n* Part-time or casual role - flexible days and hours\n* Training and mentorship to build your optical skills\n* A supportive environment where you’ll be encouraged to reach your potential\n* Start as soon as you’re ready"
  },
  {
    "id": "10",
    "title": "Optometrist - OPSM Jesmond 1",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Charlestown, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-opsm-jesmond-1-at-opsm-4305532104?position=10&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=m1JTl0o8XcHqusxvGnWluQ%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our stores you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "11",
    "title": "Sydney Optometrist - Casual Opportunities",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Sydney, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/sydney-optometrist-casual-opportunities-at-opsm-4279706374?position=11&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=WtbwkSbViw%2FnGd7l2isngQ%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our stores you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "12",
    "title": "Optometrist - OPSM Newcastle",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Charlestown, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-opsm-newcastle-at-opsm-4307041579?position=12&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=t0Fu25xO19Ks7fczOUuUtw%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our stores you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "13",
    "title": "Graduate Optometry Development Manager",
    "company": "Specsavers",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEkAnm4p3ehkA/company-logo_100_100/company-logo_100_100/0/1663750766641/specsavers_logo?e=2147483647&v=beta&t=G292pQx1ArnWlYxYwO7aRahJwQFfyR0hjujjF-9_GRU",
    "location": "Melbourne, Victoria, Australia",
    "type": "Contract",
    "applyUrl": "https://au.linkedin.com/jobs/view/graduate-optometry-development-manager-at-specsavers-4317750989?position=13&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=A%2F6D47rk1A0eXg2VAddgwA%3D%3D",
    "description": "## What we can do for you\n\nAt Specsavers, we know that to reach your full potential you need to work somewhere that will bring out your best. We pride ourselves on offering a workplace with a supportive, driven, flexible and inclusive culture. Here’s a taste of just some of our perks:\n* Quarterly bonus scheme\n* Two free pairs of glasses each year\n* On-site free parking\n* Birthday, Volunteer, Professional Development and Paid Parental Leave\n* Health & Wellbeing programs\n* Fully funded social club – provides a wide range of activities throughout the year\n\n## The Role & Team\nWe have a unique opportunity for an Optometrist to join our Graduate Optometry Team on a 12 month fixed term contract. Reporting into the Head of Graduate Development for ANZ, you will work in partnership with the three other Graduate Optometry Development Managers to help lead the delivery of the industry leading Specsavers Graduate Program. Your day-to-day will involve working with graduates and store partners to support the clinical and professional development of early-career optometrists. This is the perfect opportunity for you to shift your Optometry career in a new and unique direction!\n\n## The skills we are looking for\n* Significant professional experience as an Optometrist\n* Essential to this role is the completion of the two-year Specsavers Graduate Program\n* Excellent communication and interpersonal skills with the ability to deliver Graduate Program Workshops to small and large audiences\n* Ability to build rapport with professionals at all levels and work collaboratively within a fast-paced environment\n* Highly organised and strong attention to detail\n\n## About Us\nSpecsavers are rated the market leader for eye tests, the retailer of choice for contact lenses and one of the fastest growing hearing providers in Australia and New Zealand. We are on a continual mission to transform eye and hearing health by eliminating preventable vision loss and blindness, including Glaucoma and Diabetes, through improved prevention and early detection, as well as providing accessible and affordable hearing care."
  },
  {
    "id": "14",
    "title": "Optometrist - OPSM Jesmond 1",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Charlestown, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-opsm-jesmond-1-at-opsm-4305058576?position=14&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=Dke4DUbNQmR9MGS1nIi7xQ%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our stores you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "15",
    "title": "Experienced Optometrist - Berowra Eye Studio",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Berowra Waters, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/experienced-optometrist-berowra-eye-studio-at-provision-eyecare-4321105790?position=15&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=jfPf2l0oizphFh%2FNUV6wZg%3D%3D",
    "description": "## Job Overview\n\n> Part Time (1-2 days a week)\n\nBerowra Eye Studio is seeking an experienced and caring Optometrist to join our friendly and community-focused practice. This is a great opportunity to be part of a growing independent team that values patient care, professionalism, and genuine connection.\n\n## Why Join Us?\n* Supportive, close-knit practice team with a strong community reputation\n* Flexible part-time role, 1–2 days per week (days negotiable)\n* Work in a welcoming, modern environment with excellent patient continuity\n* Enjoy autonomy in your clinical decision-making and patient management\n\n## About The Role\nYou’ll provide comprehensive eye examinations, manage a variety of cases, and deliver personalised care tailored to each patient. Working alongside our practice owner and experienced support team, you’ll have the time and space to focus on quality optometry - not sales targets.\n\n## About You\n* Qualified and experienced Optometrist, registered with AHPRA\n* Confident, professional, and patient-centred in your approach\n* Strong communication and interpersonal skills\n* Enjoy collaborating within a small, supportive team environment\n\n## What We Offer\n* Flexible hours and a positive work-life balance\n* Supportive team that values your experience and input\n* Opportunity to contribute to a practice that prioritises genuine care and community"
  },
  {
    "id": "16",
    "title": "Locum Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Mackay, Queensland, Australia",
    "type": "Contract",
    "applyUrl": "https://au.linkedin.com/jobs/view/locum-optometrist-at-oscar-wylee-4321111421?position=16&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=itks%2FaV62s%2FtJxOILG5ebQ%3D%3D",
    "description": "## Job Overview\n\nOscar Wylee is a leading optometry retailer and healthcare provider with 130+ stores located in Australia, New Zealand and Canada, currently employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\nWe're looking for locum Optometrists capable of delivering a leading practice testing experience, effective eye care and recommendations to patients of diverse demographics.\n\nWe currently have opportunities in a range of locations and will support travelling professionals with accommodation, transportation and meal expenses in addition to the agreed fees.\n\nYou will experience full professional discretion and clinical autonomy in our modern facilities using leading practice equipment.\n\nBy joining our Talent Community you will be kept informed of all our opportunities as they open."
  },
  {
    "id": "17",
    "title": "Low Vision Consultant",
    "company": "Vision Australia",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQH1vNbCtXyhYA/company-logo_100_100/company-logo_100_100/0/1631313812510?e=2147483647&v=beta&t=BO_exdgWCgM9KRS_brwUUWugcmgQrHN53CJLFVpemMM",
    "location": "Spring Hill, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/low-vision-consultant-at-vision-australia-4334683161?position=17&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=eUXpR5Yt%2FWVnBSDSmnKF1w%3D%3D",
    "description": "## Job Overview\n\n> Permanent Full Time - Low Vision Consultant\n> Spring Hill, QLD Location with Work from Home Flexibility\n> Base Salary = $102,132 + Superannuation with Salary Packaging up to $15.9k\n\n## About Us\nQuantum, a wholly owned subsidiary of Vision Australia, is proud to provide products and services to people with a print disability (low vision, blindness or a learning difficulty). Our specialist products and services focus on wellness and reablement and meet the diverse needs of people who are blind or have low vision so they can remain an independent and integral part of the community.\n\n## About The Opportunity\nAs our Low Vision Consultant, you will be responsible for increasing revenue and grow market share through the sales and support of Assistive Technology and living aids to Low Vision and general Disability client. In this role you will also:\n* Develop customer/client procurement strategies with the aim of increasing sales of Quantum Low Vision products.\n* Represent Quantum at approved regional and metropolitan exhibitions and conferences that are aligned to the Retail strategy and target market segmentation.\n* Represent Quantum at metropolitan and regional information days organised by Quantum, Vision Australia and other agencies.\n* Build product awareness by offering professional development services to referring Professionals and Vision Australia staff.\n\n## About You\n* Evidence of up-to-date comprehensive product knowledge resulting in successful sales to meet customer needs\n* A proven track record of meeting sales goals demonstrating a highly ethical and consultative approach to selling\n* Formal qualification or Experience such as: Optical Dispensing Diploma, Orthoptist, Optometry, Aged Care or Occupational Therapy desirable\n* Recent Experience from a variety of backgrounds considered, either from Optical, Aged Care, or a related Allied Health Care role\n\n## Benefits Of Working At Vision Australia\n* Additional leave is available via our purchase leave and accrued day off schemes\n* Annual salary review to ensure your pay is in-line with the market rates\n* Easy-to-access location\n* Professional development opportunities and micro-learning sessions available for all staff"
  },
  {
    "id": "18",
    "title": "Optometrist/Graduate - Gulf & Ranges Optometrists",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Port Paterson, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-graduate-gulf-ranges-optometrists-at-provision-eyecare-4314220155?position=18&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=f0w3ULHu1B38CrwiIkKHHA%3D%3D",
    "description": "## Job Overview\n\n> Full or Part Time - Port Augusta, SA\n\nGulf & Ranges Optometrists have a unique role available for an Optometrist - whether you’re experienced, recently graduated, or anywhere in between. Join our large and supportive team in Port Augusta and experience full-scope optometry in a dynamic regional setting.\n\n## What makes us unique\n* Work alongside visiting Ophthalmologists at Port Augusta Hospital each month\n* Join a diverse optometry team: 2 senior optometrists, 2 early career optometrists and a graduate - offering daily support and mentoring\n* Access structured fortnightly multi-practice CPD, plus external courses for continual growth\n* No weekends, and our practice closes between Christmas and New Year\n* If you prefer part-time, enjoy a consistent fortnightly roster (4 consecutive days one week, 4-5 the next, depending on FTE preference)\n\n## What we’re looking for\n* Passion for full-scope optometry, with an interest in eye health management, therapeutics, and co-management with specialists\n* Strong commitment to professional development and patient care\n* A team player who thrives in a collaborative, supportive environment\n* Dispensing skills a bonus but not essential\n\n## Why you’ll love it here\n* A collaborative, values-driven culture (Fun, Attention to detail, Continuous improvement, Trust, Teamwork)\n* Opportunity to develop advanced clinical skills with direct support and mentoring\n* The unique lifestyle of Port Augusta - the gateway to the Flinders Ranges and Eyre Peninsula, offering bushwalking, camping, swimming with cuttlefish, and easy weekend adventures"
  },
  {
    "id": "19",
    "title": "Optometrist Innisfail OPSM",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Innisfail, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-innisfail-opsm-at-opsm-4301175998?position=19&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=T%2BWmS35BM9B46w4HxWLduA%3D%3D",
    "description": "## Job Overview\n\nTake the next step in your optometry career with OPSM Innisfail, where clinical excellence and lifestyle come together. As an optometrist, you’ll value the variety and challenge of regional practice, working with a diverse patient base and managing a broad scope of clinical cases that keep your skills sharp and rewarding.\n\nWe currently have an amazing opportunity for a recent graduate or experienced optometrist to join our Innisfail team. This role would suit a practitioner with a special interest in ocular pathology and the practice is well equipped with an Optos NG, Automated Phoroptor, I-care and a Visual Field.\n\nAt OPSM we can offer you an opportunity to make a real difference in the way people see the world. You will be able to access many opportunities for continuing professional development through financially supported industry training as well as peer learning communities. Scholarships are also available to support further study in special interest areas.\n\nAn attractive salary and relocation package are available for the right candidate as well as a generous product allowance for you to enjoy wearing our premium brands and other benefits too. You will also have the opportunity to join our mission to help the world see by participating in our OneSight outreach program."
  },
  {
    "id": "20",
    "title": "Optometrist - Port Lincoln",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Port Lincoln, South Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-port-lincoln-at-opsm-4316471034?position=20&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=9CL7eCzDlO%2Btety1L5SYaA%3D%3D",
    "description": "## Who We Are\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. With over 180,000 dedicated employees in 150 countries driving our iconic brands, our people are creative, entrepreneurial and celebrated for their unique perspectives and individuality.\n\n## Job Overview\n> Optometrist – Full Time | OPSM Port Lincoln\n\nJoin a leader in eyecare and eyewear. Make a difference in a close-knit community with cutting-edge technology at your fingertips. OPSM Port Lincoln is looking for a passionate Graduate or Experienced Optometrist to join our team full-time. With a newly renovated store, a supportive and experienced retail team, and access to state-of-the-art diagnostic equipment—including WAM700, Zeiss & Revo OCT, UWDRS, Icare, and HFA3—you’ll have all the tools you need to deliver exceptional care.\n\n## Why Join OPSM?\n* Work with premium diagnostic technology and iconic eyewear brands including Ray-Ban, Oakley, Prada, and more\n* Access a structured graduate development program (for new grads) and CPD through the Leonardo learning platform\n* Enjoy employee product discounts and annual product allowances\n* Get involved with global volunteering opportunities through OneSight\n* Be part of EssilorLuxottica, the world leader in eyewear and eyecare\n\n## Your Role\n* Perform a wide range of eye exams, including paediatrics, contact lenses, and therapeutics\n* Tailor lens solutions to lifestyle needs\n* Educate patients on lens and diagnostic technologies\n* Collaborate with your retail team and foster a one-team approach\n* Contribute to a patient-first, team-oriented environment"
  },
  {
    "id": "21",
    "title": "Optometrist | Devonport",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Devonport, Tasmania, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-devonport-at-george-matilda-eyecare-4317739787?position=21&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=rWWGaMSaQ%2BfONkPnMVNngg%3D%3D",
    "description": "## Job Overview\n\nAre you ready to slow things down and truly connect with your patients? At Eyelines Devonport, we believe great eyecare starts with time, time to listen, to care, and to build relationships. We're on the lookout for a Part-Time Optometrist who’s passionate about making a real difference in the local community.\n\n## What We’re Looking For\n* AHPRA Registered Optometrist and at least 2 years’ practical experience\n* A warm, clear, and confident communication style that puts patients at ease\n* A genuine passion for eyecare and optical fashion\n* A commitment to putting patients first every time\n* A curiosity to stay up to date with industry innovations and technology\n* Available 26.5 hours per week, Wednesday–Saturday (Saturdays until 1pm).\n\n## Why You’ll Love Working With Us\nAt Eyelines, we’re proudly Australian, passionate about our people, and dedicated to giving our team the freedom to deliver care that truly matters. You’ll Enjoy:\n* Career progression opportunities with full support from our Professional Services team\n* A supportive, down-to-earth environment where you can be yourself and thrive\n* A competitive salary package (plus super, OA, AHPRA, and CPD allowance)\n* Monthly bonus structure — earn extra for great results!\n* Free eye exams + annual product allowance\n* Family and friends’ discounts — because we care about those you care about\n\n## About Eyelines\nWe’re all about comprehensive eyecare for the whole family, from detailed eye exams to stylish prescription eyewear and the latest contact lenses. We celebrate individuality, encourage diversity, and strive to create a workplace where everyone feels included and valued."
  },
  {
    "id": "22",
    "title": "Optometrist [6 months contract - Maternity leave]",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Macquarie Park, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-6-months-contract-maternity-leave-at-oscar-wylee-4321706190?position=22&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=z3vSUuiKllRsF2PU7H2I5g%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities.\n\nWe also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "23",
    "title": "Optometrist - FT - Hobart",
    "company": "Bailey Nelson",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQG8TneXVatI6Q/company-logo_100_100/company-logo_100_100/0/1738623961765/bailey_nelson_logo?e=2147483647&v=beta&t=irwo47qmgl96PR_fgx2eSzDfOh-_fny2k96bECVzWdM",
    "location": "Hobart, Tasmania, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-ft-hobart-at-bailey-nelson-4242711052?position=23&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=egD%2FVYI3%2Fj%2B9PboqtEKbaw%3D%3D",
    "description": "## Job Overview\n\nBailey Nelson is looking for a Full Time Optometrist to join our experienced team in Hobart CBD. This is a fantastic opportunity to work alongside with one of our leading Optometrists and our fun retail team in a busy double clinic store. As a Bailey Nelson Optometrist, your mission will be to to deliver the best possible eyecare and overall experience to your customers and patients every day.\n\n## What you will get from us\n* A job where you can make a real difference to meeting customers' eyecare needs\n* The necessary equipment to perform in your role, including OPTOS\n* Competitive salary for the right person with the right level of experience\n* Experience our Annual Leadership conference\n* Very attractive incentive scheme with monthly, quarterly and annual bonuses\n* Access to our world-class web-based learning platform\n* A generous team allowance so you can strut your stuff in and out of store in the latest BN products\n* A monthly allowance for your store to reward, incentivise and recognise the team you work with\n* Relocation support if needed\n* Flexible roster\n\n## What we need from you\n* Experience - minimum 1 year experience as an Optometrist in a busy store/clinic with 20 minute testing\n* Passion - A genuine passion for creating amazing experiences for your customers\n* Energy - A love of being in a fast paced, growing business and able to adapt to change\n* Leadership - Commitment to inspiring, motivating, training and developing your team\n* Effectiveness - Ability to effectively manage your time and all operational requirements\n* Team - Passion for building a strong partnership with your Store Manager\n* Drive - A true love of achieving and driving results"
  },
  {
    "id": "24",
    "title": "Optometrist | Scone",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Scone, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-scone-at-george-matilda-eyecare-4321265722?position=24&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=EnxO8rnkuVxHfgoO9AC1fg%3D%3D",
    "description": "## Job Overview\n\n> See Yourself in Scone.\n\nWe’re looking for an experienced optometrist to join our practice in Scone – a tight-knit regional town in the Upper Hunter with deep community roots, a loyal patient base, and room to live a balanced life.\n\n## About The Role\nThis is a rare opportunity to step into an established practice where your clinical decisions are trusted, your time with patients is protected, and your voice helps shape the future of care. You’ll have the support to deliver best-practice optometry, and the freedom to pursue your interests in areas like ocular disease and dry eye management.\n\n## About The Practice\n* Centrally located in the heart of Scone’s shopping precinct\n* Equipped with advanced diagnostic technology including OCT, fundus imaging, visual fields, and rebound tonometry\n* 30-minute appointments as standard\n* A friendly and supportive dispensing team who understands your clinical flow\n* Genuine autonomy backed by a national network\n* A multigenerational patient base who value continuity and care\n\n## What We’re Looking For\n* A broad, confident clinical skillset and a desire to keep learning\n* At least 2 years’ post-grad experience\n* The ability to tailor care across a wide demographic, from young to young-at-heart\n* Clear, patient-first communication\n* A collaborative mindset with a strong sense of ownership\n* Comfort in practicing independently while contributing to a broader team\n\n## What We Offer\n* Competitive salary + super + CPD/AHPRA/OA allowance\n* Regular Performance Bonuses – earn more, regularly\n* Ongoing education and development opportunities\n* Family and friends discounts + annual product allowance\n* Support to build your clinical interests\n* A chance to make a visible difference in a town that values its healthcare providers"
  },
  {
    "id": "25",
    "title": "EyeQ Young & Cootamundra - Permanent Optometrist",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "Young, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-young-cootamundra-permanent-optometrist-at-eyeq-optometrists-4301978678?position=25&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=VTD64zYAezUue4bFhIUmZw%3D%3D",
    "description": "## Job Overview\n\n> EyeQ– Young Full-Time or Part-Time Optometrist\n\nAt EyeQ we are all about our people who deliver exceptional customer experiences. It is our passion to provide customers with a personalised approach to eye care, developing long-lasting relationships. Fundamentally, we believe that people deserve quality time with their Optometrist; something we like to call Humanised Optometry.\n\nIf you share these values, EyeQ have an Optometry position available in our Young & Cootamundra. The practice is well equipped including OPTOS Daytona retinal imaging and OCT.\n\nYou will play a pivotal role in building loyal and trusting relationships with the community to grow the practice. Our patients are great country people, and appreciate an optometrist with enthusiasm, great clinical skills and a warm heart! You will be able to access many opportunities for continuing professional development through financially supported industry training, peer learning communities, as well as scholarships to further your studies in special interest areas. We offer competitive salaries and incentives, a generous product allowance, and other benefits."
  },
  {
    "id": "26",
    "title": "Optometrist Metro Adelaide SA - Full Time or Part Time Considered",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Adelaide, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-metro-adelaide-sa-full-time-or-part-time-considered-at-opsm-4320327992?position=26&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=XEiH%2F%2B1tX%2FRYfzvjA%2F24ow%3D%3D",
    "description": "## Job Overview\n\n> Optometrist – Permanent Part Time or Full Time Considered| OPSM Metro Adelaide\n\nJoin a leader in eyecare and eyewear. Make a difference across the community with cutting-edge technology at your fingertips. We are looking for a passionate Optometrist with 1 year or more experience to join our permanent metro relief Optometry team. With access to state-of-the-art diagnostic equipment—including WAM700, Zeiss & Revo OCT, UWDRS and Icare to name a few —you’ll have all the tools you need to deliver exceptional care.\n\n## Why Join OPSM?\n* Work with premium diagnostic technology and iconic eyewear brands including Ray-Ban, Oakley, Prada, and more\n* Access to CPD through the Leonardo learning platform\n* Enjoy employee product discounts and annual product allowances\n* Get involved with global volunteering opportunities through OneSight\n* Be part of EssilorLuxottica, the world leader in eyewear and eyecare\n\n## Your Role\n* Perform a wide range of eye exams, including paediatrics, contact lenses, and therapeutics\n* Tailor lens solutions to lifestyle needs\n* Educate patients on lens and diagnostic technologies\n* Collaborate with your retail team and foster a one-team approach\n* Contribute to a patient-first, team-oriented environment"
  },
  {
    "id": "27",
    "title": "Casual Optical Dispenser | McMahons Point",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mcmahons Point, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-mcmahons-point-at-george-matilda-eyecare-4312630389?position=27&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=1%2BwCsCwr7SFRL2LBXT9GYw%3D%3D",
    "description": "## Job Overview\n\nWe are looking for a Casual Optical Dispenser with a knack for making people happy, because who says customer service can't be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nEstablished in 1992, Michael Angelos moved his Optometric practice from North Point to Greenwood Plaza, and relocated in 2013 to a chic new practice in the beautiful McMahons Point Village – the first-class service continues today."
  },
  {
    "id": "28",
    "title": "Casual Optical Dispenser | Mosman",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mosman, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-mosman-at-george-matilda-eyecare-4311633897?position=28&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=1IqDCc2d5jht4r4kTS3J4w%3D%3D",
    "description": "## Job Overview\n\nWe’re on the lookout for a Casual Optical Dispenser who knows how to combine great service with great energy — because who says customer service can’t be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nPeter Hewett Optometrists was established by Peter’s grandfather in 1923. The team focuses on comprehensive eye examinations, prescription sunglasses, spectacle frames, contact lenses, and eye health care for the whole family."
  },
  {
    "id": "29",
    "title": "EyeQ Young/Cootamundra - Permanent Optometrist",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-young-cootamundra-permanent-optometrist-at-eyeq-optometrists-4319275638?position=29&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=0D0vgNxuWVgeHoUHKMZQkw%3D%3D",
    "description": "## Why EyeQ Young / Cootamundra?\n\n> Join Our Team at EyeQ Young / Cootamundra – Optometrist Opportunity\n\nEyeQ Optometrists Young and Cootamundra are seeking a passionate and community-focused Optometrist to join our friendly and experienced teams in the beautiful Hilltops region of New South Wales. At EyeQ, we take pride in delivering personalised, high-quality eyecare to generations of loyal patients. You’ll enjoy true clinical autonomy, supported by national systems, advanced technology, and a knowledgeable, close-knit retail team.\n\n## What We Offer\n* Competitive salary package\n* Well-established practices with a strong community reputation\n* Loyal patient base and a supportive, experienced team\n* Flexibility – part-time and full-time options available\n* No late nights, Sundays, or extended hours\n* Opportunities for clinical growth, mentoring, and professional development\n* Access to CPD, ongoing education, and national conferences\n\n## What We’re Looking For\n* A qualified and registered Optometrist (new graduates welcome!)\n* A passion for patient-centred care\n* Excellent communication and clinical decision-making skills\n* A team player who values long-term patient relationships"
  },
  {
    "id": "30",
    "title": "Optometrist | Mudgee",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mudgee, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-mudgee-at-george-matilda-eyecare-4320600547?position=30&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=kYyunsJ6j82uyNi4aglAIw%3D%3D",
    "description": "## Job Overview\n\n> Make Mudgee Yours\n\nThis is regional optometry at its best – a high standard of care in a beautiful setting. Mudgee is a nationally recognised tourism town with a strong community spirit, award-winning wineries, and stunning scenery. You will be practicing in a spacious, light-filled, and purpose-fitted terrace home in the heart of town.\n\n## About The Role\nThis is a wonderful opportunity for an optometrist to join an established practice and continue our legacy of delivering uncompromising local eyecare. You’ll be managing end-to-end eyecare across a wide patient base, in a practice known for its clinical independence, longstanding community trust, and close ties with local GPs and ophthalmologists.\n\n## About The Practice\n* Centrally located in the heart of Mudgee’s shopping precinct\n* Equipped with advanced diagnostic technology including OCT, Optos widefield imaging, visual fields, and corneal topography\n* 30-minute appointments as standard\n* A friendly and supportive dispensing team who understands your clinical flow\n* Genuine autonomy backed by a national network\n* A multigenerational patient base who value continuity and care\n\n## What We’re Looking For\n* A broad, confident clinical skillset and a desire to keep learning\n* At least 2 years’ post-grad experience\n* The ability to tailor care across a wide patient demographic, from young to young-at-heart\n* Clear, patient-first communication\n* A collaborative mindset with a strong sense of ownership\n* Comfort in practicing independently while contributing to a broader team\n\n## What We Offer\n* Competitive salary + super + CPD/AHPRA/OA allowance\n* Regular Performance Bonuses – earn more, regularly\n* Ongoing education and development opportunities\n* Family and friends discounts + annual product allowance\n* Support to build your clinical interests\n* A chance to make a visible difference in a town that values its healthcare providers"
  },
  {
    "id": "31",
    "title": "Experienced Optical Dispenser - OptoMed",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Norwood, South Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/experienced-optical-dispenser-optomed-at-provision-eyecare-4318331561?position=31&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=e0uYiHmZcVBKcQp4fGMvVQ%3D%3D",
    "description": "## Job Overview\n\n> Part Time and/or Full Time available - Norwood, SA\n\nOptoMed is a boutique optometry practice in Norwood known for its personalised care, curated eyewear, and attention to detail. We’re looking for an experienced Optical Dispenser who takes pride in delivering a world-class patient experience.\n\n## The Role\nYou’ll work closely with the Optometrist as the key point of contact for patients - guiding them from booking to eyewear collection. It’s a hands-on role where you’ll manage everything front-of-house, from helping clients choose frames to processing lens orders.\n\n## You’ll\n* Dispense premium eyewear, including Hoya and Essilor lenses\n* Manage bookings, calls, and administrative tasks\n* Deliver genuine, detailed care to every patient\n* Represent boutique brands with confidence and style\n\n## About You\nYou’re an experienced dispenser (2+ years) who’s as comfortable adjusting frames as you are making patients feel at ease. You’re proactive, articulate, and genuinely interested in building lasting relationships. You’ll thrive here if you:\n* Have a passion for eyewear, aesthetics, and detail\n* Enjoy taking initiative and finding solutions\n* Are reliable, approachable, and genuinely care about people\n* Want to keep learning and contributing to a business that values excellence\n\n## Why You’ll Love It\n* Boutique, high-quality practice with a warm, professional team\n* Work with premium eyewear and lens brands\n* Ongoing learning and career growth in a forward-thinking business\n* Competitive hourly rate $30–$35/hr + bonuses, depending on experience"
  },
  {
    "id": "32",
    "title": "OPSM Optometrist - Belconnen",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Belconnen, Australian Capital Territory, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/opsm-optometrist-belconnen-at-opsm-4320313808?position=32&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=mQcRRlumrpS9oW6YIlDVkA%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our Belconnen store you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "33",
    "title": "Optometrist Casual Gold Coast 1",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Springwood, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-casual-gold-coast-1-at-opsm-4262364060?position=33&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=2TBMwVU5vra6gr93IkRdiQ%3D%3D",
    "description": "## Job Overview\n\nAt OPSM we are obsessed with eye care and offering our patients the confidence in how they see their world. As a leading eye care and eyewear retailer, we have been looking after the eyes of Australians and New Zealanders for over 93 years.\n\nWe use the most cutting-edge products and technologies, and collaborate with an amazing collective of knowledgeable and experienced Optical professionals. As an Optometrist with us, you will get to work with world class technology including CLARIFYE, WAM800, OCT (with Biometry), IPL, the Optos Next Generation.\n\nCurrently, we have a position available on our Casual Gold Coast Optometry Relief Team for a recent graduate or experienced optometrist to join our team. This position would suit an optometrist that likes variety and enjoys working in well equipped practices alongside experienced and supportive optometrists and dispensing teams.\n\nAt OPSM we can offer you an opportunity to make a real difference in the way people see the world. You will be able to access many opportunities for continuing professional development through financially supported industry training, peer learning communities and product training. We offer competitive salaries and incentives, a generous product allowance, and lots of other great benefits too."
  },
  {
    "id": "34",
    "title": "Optical Assistant/Dispenser - Bright Eyes Optics",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Mona Vale, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-bright-eyes-optics-at-provision-eyecare-4293514877?position=34&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=9jQnCWQ4I4ZAbq7iSFZx%2BA%3D%3D",
    "description": "## Job Overview\n\n> Part Time/Casual - Mona Vale, NSW\n\nAre you passionate about people, love a good chat, and keen to grow in a dynamic and supportive environment? Bright Eyes Optics, a newly opened independent optometry practice in Mona Vale, is looking for a reliable and enthusiastic Optical Assistant or Dispenser to join our growing team!\n\n## Why Join Us?\n* Be part of an exciting new chapter in a fresh, modern practice\n* Flexibility - part time, or casual options available (days to be discussed)\n* Work closely with a small, supportive team where your ideas and energy make a difference\n* Develop your skills with varied responsibilities and opportunities to grow\n\n## About The Role\nYour key responsibilities will include:\n* Greeting and engaging with patients in a warm and professional manner\n* Assisting patients in selecting frames and lens options to suit their needs and style\n* Providing tailored advice on lens features and benefits\n* Handling sales transactions and appointment bookings\n* Keeping the space clean, tidy, and welcoming\n\n## We’d Love to Hear from You if You\n* Have a background in customer service (optical or retail experience is a bonus!)\n* Are approachable, adaptable, and keen to learn\n* Can communicate clearly and confidently with a wide range of people\n* Take initiative and enjoy being part of a close-knit team\n* Are reliable and motivated to build a role in the optical industry\n\n## What We Offer\n* A competitive hourly rate ($28 - $40/hr depending on experience)\n* Flexibility - part time and casual options available, with days to be discussed\n* A positive, down-to-earth work culture\n* On the job training and support to develop your skills\n* Staff discounts and opportunities for growth as the practice expands"
  },
  {
    "id": "35",
    "title": "Vision Therapist - Bassendean Optical",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Ashfield, Western Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/vision-therapist-bassendean-optical-at-provision-eyecare-4321125785?position=35&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=v%2FTIFZ9njgrrFM6RIXbeeA%3D%3D",
    "description": "## Job Overview\n\n> Part or Full Time - Bassendean, WA\n\nMake a real difference to patients’ lives through specialised vision care. Bassendean Optical, an independent practice with a focus on children’s vision and neuro-visual rehabilitation, is seeking a Vision Therapist to join our skilled and supportive team.\n\n## About The Role\nAs a Vision Therapist, you’ll deliver tailored therapy programs to patients with:\n* Visual difficulties in children (e.g., lazy eye, eye-turn, learning-related vision issues)\n* Neurological conditions, including stroke, concussion, or brain injury\n\nThis position could also suit an Optical Dispenser or Optical Assistant looking to expand their clinical expertise, with full training and mentorship provided.\n\n## About You\nYou’ll be a strong candidate if you are:\n* Patient-focused and empathetic, with excellent communication skills\n* Confident working with children and adults with complex visual needs\n* Flexible, adaptable, and able to problem-solve in real-time\n* Motivated to learn and grow within a specialist clinical role\n\n## Why Join Us?\n* Work in a modern, well-equipped practice with a collaborative, supportive culture\n* Opportunity for specialist clinical development and formal vision therapy training\n* Make a tangible difference to patients’ visual function and quality of life\n* Hours: Part or Full time (with flexibility)"
  },
  {
    "id": "36",
    "title": "Optical Assistant / Dispenser - Hammond Optometry",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Cooloolabin, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-hammond-optometry-at-provision-eyecare-4307331639?position=36&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=OkxbWr8npYcHzRqLkWj%2F%2FA%3D%3D",
    "description": "## Job Overview\n\n> Full Time / Part Time - Nambour, Sunshine Coast\n\nHammond Optometry is a well-respected independent practice known for its commitment to exceptional patient care. We’re looking for a friendly and customer focused Optical Assistant or Dispenser (full-time or part-time) to join our team. If you thrive in a retail environment, enjoy helping people, and have a keen eye for style, this could be the perfect opportunity for you.\n\n## About You\nNo optical experience? No problem! If you have strong retail, fashion, or customer service experience, we’ll provide the training to help you succeed in optical dispensing.\n\n### Essential Attributes\n* Strong retail experience (optical experience is a plus but not required)\n* Excellent communication and customer service skills\n* Confidence in styling and an eye for colour coordination\n* Ability to work both independently and as part of a team\n* Detail-oriented with strong organisational skills\n\n## About The Role\nIn this role, you will be a key part of our team, helping customers find the perfect eyewear while delivering an outstanding in store experience. Your day-to-day responsibilities will include:\n* Assisting customers in selecting frames and lenses that suit their style and needs\n* Providing excellent customer service and building strong patient relationships\n* Handling sales transactions and ensuring a smooth retail experience\n* Staying up to date with eyewear trends to offer informed recommendations\n* Supporting general administrative and reception tasks as needed\n* Helping maintain store presentation and organisation\n\n## What We Offer\n* A supportive and friendly team environment\n* Flexible working arrangements – full-time or part-time options available\n* On-the-job training to develop your optical dispensing skills\n* Work-life balance with no late nights"
  },
  {
    "id": "37",
    "title": "Optometrist State Relief QLD/NT/Northern NSW OPSM",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Springwood, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-state-relief-qld-nt-northern-nsw-opsm-at-opsm-4314585776?position=37&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=C%2FFtpHmO7TVyihx2UalEaA%3D%3D",
    "description": "## Job Overview\n\nFrom the tropical reefs of Cairns to the red heart of Alice Springs, the coastal charm of Coffs Harbour and Byron Bay, and the vibrant communities of Townsville and Port Macquarie, this full-time role offers a unique opportunity to experience some of Australia’s most beautiful and diverse regions.\n\nWe currently have an amazing opportunity for a graduate or experienced optometrist to join OPSM as a State Relief Optometrist, travelling across Queensland, the Northern Territory, and Northern NSW to support our dynamic teams. Each store is equipped with our latest technology, including Optos NG, OCT, Topographers, Auto refractor/K, pachymetry, Biometry, Cataract Retro-Illumination, I-Care, NCT and VF.\n\nAt OPSM, we’re about innovation. We use cutting-edge products and technologies and collaborate with an inspiring network of knowledgeable and passionate optical professionals. As a leading eye care and eyewear retailer, we’ve been looking after the eyes of Australians and New Zealanders for over 95 years.\n\nThis role offers flexibility, variety, and the chance to work with experienced optometrists while building lasting connections with diverse communities. You’ll also access extensive continuing professional development, industry training, peer learning, and product training, with a competitive salary, generous product allowance, AHPRA included and the opportunity to make a global impact through our OneSight outreach program."
  },
  {
    "id": "38",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Mermaid Beach, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318388056?position=38&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=xAjABj6ZE78%2B1TbJx%2B5TtA%3D%3D",
    "description": "## Benefits\n* Amazing salary package + relocation bonus + AHPRA & OAA reimbursement\n* Work-life balance, rostered Tuesday-Saturday only\n* Career development opportunities and in house trainings are available for Graduates (welcome to apply)\n* Receive 2 x free prescription eyewear per calendar year to keep you on trend\n\n## About The Company\nOscar Wylee is a leading optometry company with 140+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique, and fashionable product to all.\n\n## About The Role\nWe are seeking a qualified and AHPRA registered Optometrist who pride themselves in high level of customer service and capable of delivering leading practice testing experience to patients of diverse demographics.\n* Fantastic professional growth for everyone to achieve new heights\n* A company where you can actually make a difference in the lives of customers every day\n* A welcoming atmosphere that spans the whole organization\n* Supportive Employee Assistance and Wellbeing Programs to balance work and private life\n* A team that is friendly and close-knit"
  },
  {
    "id": "39",
    "title": "Part Time Optical Dispenser | Moss Vale",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Moss Vale, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/part-time-optical-dispenser-moss-vale-at-george-matilda-eyecare-4319108724?position=39&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=2oDohj6VTtWRJhj3KSp8yg%3D%3D",
    "description": "## Job Overview\n\nAre you passionate about helping people see the world more clearly? We’re looking for an enthusiastic and customer-focused Optical Dispenser to join our friendly team on a part-time basis.\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs.\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nMoss Vale Optical was established by Gary and Amanda in 1994 and has been looking after the Eyecare needs of the local community and surrounding areas for over 30 years."
  },
  {
    "id": "40",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Smeaton Grange, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318375577?position=40&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=tEyZGETgbY9Z444p4hwPGQ%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "41",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Brisbane, Queensland, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4320351659?position=41&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=zQFYxkdovj58Efnj3%2FtQow%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nSeeking a qualified and AHPRA registered Optometrist to join our globally growing network of optometry services. Joint venture partnership opportunities and relocation support available. Part time opportunity.\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. Preferred 3-4 Days a Week Coverage. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nWe also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "42",
    "title": "Managing Optometrist Maroochydore OPSM",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Maroochydore, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/managing-optometrist-maroochydore-opsm-at-opsm-4300292846?position=42&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=TMp789h1Zp5BVssLIyGZuQ%3D%3D",
    "description": "## Job Overview\n\nStretching from Caloundra to Noosa, the Sunshine Coast in Queensland offers more than just relaxation – it provides an active lifestyle. This unique mix of coastal and hinterland beauty ensures that every weekend feels like a getaway.\n\nWe currently have an amazing opportunity for an experienced optometrist to join our Maroochydore OPSM team. This store is equipped with our latest CLARIFYE technology with Optos NG, OCT, retinal camera, Topography, Auto refractor/K, pachymetry, Biometry, Cataract Retro-Illumination, I-Care, NCT and VF.\n\nAt OPSM we are about innovation. We use the most cutting-edge products and technologies and collaborate with an amazing collective of knowledgeable and experienced optical professionals. As a leading eye care and eyewear retailer, we have been looking after the eyes of Australians and New Zealanders for over 95 years.\n\nWe can offer you access to great clinical and business ideals, the opportunity to work alongside other experienced optometrists and you will also get to play a pivotal role in building loyal and trusting relationships with the community to grow the practice. An attractive salary is available for the right candidate as well as a generous product allowance for you to enjoy wearing our premium brands and other benefits too."
  },
  {
    "id": "43",
    "title": "Casual Optical Dispenser - Charlestown Eyecare",
    "company": "Bendigo Advertiser",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQH9cP7y-Qmufg/company-logo_100_100/company-logo_100_100/0/1631388401759?e=2147483647&v=beta&t=Gig16tlvPlETVmQJsrxyiJe05DB5UF14ba76FwWJrQA",
    "location": "Bar Beach, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-charlestown-eyecare-at-bendigo-advertiser-4322716319?position=43&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=Pnivq5moVP04xpak102qDA%3D%3D",
    "description": "## Job Overview\n\nNational Optical Care, are a community of optometry practices that are passionate about empowering eye care excellence. We recently merged with George and Matilda, leveraging the combined expertise of our practice community with strong supplier relationships to deliver the very best in patient care. Charlestown Eyecare has been offering comprehensive optical care to locals and residents for more than 30 years. We are searching for a Casual Dispenser to grow our team.\n\n## About The Role\n* Provide friendly and efficient reception service\n* Assist patients in the selection of optical frames taking into account lifestyle and physical needs\n* Recommend use of ancillary products (e.g. contact lens care products).\n* Support other team members in the achievement of practice goals and objectives including processing payments, entering stock, and stock takes\n* Maintain a high level of housekeeping in the practice\n\n## Our Benefits\n* Learning and development opportunities tailored to your goals\n* Great discounts across frames and lenses including family and friends\n* Employee Assistance Program (EAP)\n* Perks and bonus Programs\n* Work with a great team who are truly invested in their patients\n\n## About You\n* Effective communication and customer service skills\n* Team focused alongside independent work\n* Strong organizational skills and ability to problem solve\n* Positive and energetic attitude\n* Experience in the optical industry is preferred, however for those eager to take on a new career we are willing to develop\n* With no weekend work or late nights"
  },
  {
    "id": "44",
    "title": "Optometrist Casual Brisbane North",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Springwood, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-casual-brisbane-north-at-opsm-4294515529?position=44&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=5rVNZcChElHuCD3KhWUhag%3D%3D",
    "description": "## Job Overview\n\nAt OPSM we are obsessed with eye care and offering our patients the confidence in how they see their world. As a leading eye care and eyewear retailer, we have been looking after the eyes of Australians and New Zealanders for over 93 years. We are not your typical retail business.\n\nWe use the most cutting-edge products and technologies, and collaborate with an amazing collective of knowledgeable and experienced Optical professionals. As an Optometrist with us, you will get to work with world class technology including CLARIFYE, WAM800, OCT (with Biometry), IPL, the Optos Next Generation.\n\nCurrently, we have a position available on our Casual Brisbane Optometry Relief Team for a recent graduate or experienced optometrist to join our team. This position would suit an optometrist that likes variety and enjoys working in well equipped practices alongside experienced and supportive optometrists and dispensing teams.\n\nAt OPSM we can offer you an opportunity to make a real difference in the way people see the world. You will be able to access many opportunities for continuing professional development through financially supported industry training, peer learning communities and product training. We offer competitive salaries and incentives, a generous product allowance, and lots of other great benefits too."
  },
  {
    "id": "45",
    "title": "Optometrist incl. Graduates - Fire Station Optometrists",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Mount Gambier, South Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-incl-graduates-fire-station-optometrists-at-provision-eyecare-4285497258?position=45&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=pYyCxl1aj2jZqs3sz1178g%3D%3D",
    "description": "## Job Overview\n\n> Full Time - Mount Gambier, SA\n\nBuild your career, broaden your skills, and enjoy a life less ordinary. Fire Station Optometrists in Mount Gambier is seeking an Optometrist or recent Graduate ready to grow in a supportive, collaborative, and values-driven team. You’ll be immersed in full-scope optometry with strong mentoring, structured training, and the chance to work closely with ophthalmologists and a diverse patient base.\n\n## The Opportunity\n* Grow your clinical confidence through measured skill development and personalised learning pathways\n* Work alongside experienced optometrists and receive ongoing mentorship\n* No weekends and time off between Christmas and New Year\n* Occasional support visits to Port Augusta and Victor Harbor for variety and exposure to other regional locations\n\n## What You’ll Be Doing\n* Full-scope optometry including:\n* Eye health and therapeutic management\n* Co-management with resident and visiting Ophthalmologists\n* Supporting a culturally diverse patient base with care and respect\n* Dispensing support (preferred but not essential)\n\n## Why Join Fire Station Optometrists?\n* Work in a respected regional practice with deep community ties\n* Collaborate with a team across three locations with regular peer connection and CPD\n* Enjoy a relaxed, regional lifestyle with easy access to the Limestone Coast, the Grampians, and the Great Ocean Road"
  },
  {
    "id": "46",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Brendale, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318388054?position=46&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=mplP86e29r%2FoU1jqD5FNeA%3D%3D",
    "description": "## Job Overview\n\n> Receive 2 x free prescription eyewear per calendar year to keep you on trend!\n\nSeeking a qualified and AHPRA registered Optometrist to join our globally growing network of optometry services. Joint venture partnership opportunities and relocation support available. Full time, Tuesday to Saturday availability preferred.\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service. We're looking for professionals capable of delivering a leading practice testing experience, effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nWe also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "47",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Mount Pritchard, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318366816?position=47&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=o0HQoGmg4LnYD4mR4n8Giw%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "48",
    "title": "Optical Assistant/Dispenser - Lakeview Eyecare",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Patterson Lakes, Victoria, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-lakeview-eyecare-at-provision-eyecare-4321766839?position=48&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=qarQkygwv9K0ORfNdffTLg%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Patterson Lakes\n\nLakeview Eyecare is a proudly independent, locally owned practice that’s been caring for our community’s eyes for over 30 years. We’re now looking for someone to join our small, friendly team to help us continue delivering the personalised eyecare our patients know and trust.\n\n## About You\nYou’re someone who enjoys connecting with people and providing great service. You bring strong retail experience, love learning new things, and work well in a team environment. If you have marketing knowledge or experience - fantastic! Optical dispensing experience is also welcome, but not essential - we’re happy to support the right person to grow in the role.\n\n## When We Need You\n* Monday: full day\n* Thursday: hours to be discussed\n* Saturday: 9am–1pm You’ll also have the flexibility to cover annual or sick leave when needed.\n\n## Why You’ll Love Working Here\n* Diverse and loyal patient base\n* Genuine learning and development opportunities\n* A well-run, cohesive team of four\n* Convenient location in a small local shopping centre\n* Over 30 years of trusted eyecare in the community\n\n## Our Culture\nAt Lakeview Eyecare, we love working in the community, for the community. Our optometrists are passionate about eyecare, continuous learning, and staying at the forefront of new research and technology. We take pride in offering thoughtful, tailored solutions - and in creating an environment where both patients and team members feel genuinely cared for."
  },
  {
    "id": "49",
    "title": "Optometrist | Kalgoorlie",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Kalgoorlie, Western Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-kalgoorlie-at-george-matilda-eyecare-4318339323?position=49&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=Pm0rv8MFwX6i1jGitrb8%2Bg%3D%3D",
    "description": "## Job Overview\n\nDo you want to take more time, more care, and get to know your patients better? Our team in Kalgoorlie are looking for an Optometrist to embed themselves in the local community and continue their tradition of providing exceptional eyecare.\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience to achieve goals, leading your team to greatness, then this role may be for you. We are searching for someone with the following skills:\n* Optometrist qualification with +2 years practical experience\n* Be able to use your optical knowledge and experience to communicate clearly with patients in a bright and friendly manner\n* Have a passion about putting the customer’s eye health first\n* A passion for optical style and fashion\n* Willing to keep up-to-date with industry developments\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level with the support of a proudly Australian organisation. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* A competitive annual salary package + super + OA + AHPRA + CPD Allowance\n* Earn extra cash every two weeks with a fortnightly bonus structure!\n* Continuing education and ongoing training and development\n* Free eye examinations, annual product allowance and family and friends’ discounts and benefits\n* Career progression and development with support from our Professional Services team\n* The chance to feel truly independent while having the additional support of our office functions\n\n## About The Business\nOur practice has a focus on comprehensive eye examinations, prescription sunglasses, spectacle frames, contact lenses, and eye health care for the whole family."
  },
  {
    "id": "50",
    "title": "Part Time Optical Dispenser | Dee Why",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Dee Why, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/part-time-optical-dispenser-dee-why-at-george-matilda-eyecare-4314594466?position=50&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=mStXYh91IqdflVDcg3uuIQ%3D%3D",
    "description": "## Job Overview\n\n> Part-Time Optical Dispenser – Dee Why\n\nAre you an experienced Optical Dispenser seeking a stable part-time role (33 hours per week, with additional or full-time hours available for the right candidate)? Join our friendly, community-focused team — we’d love to meet you!\n\n## What You’ll Bring\nIf you’re passionate about great service and enjoy connecting with people, you’ll feel right at home. Ideally, you’ll have:\n* A love for patient care and friendly communication\n* Retail experience (optical experience essential!)\n* Quick learning skills and confidence sharing product knowledge\n* A team-first attitude with energy, enthusiasm, and patience\n* Flexibility to work varied hours — including weekends, public holidays, or late trade when needed\n\n## Why You’ll Love It Here\nWe believe in giving our people the freedom and flexibility to deliver genuine care at the local level — with the backing of a proudly Australian organisation.\n* On-the-job training with an experienced and supportive manager\n* Attractive hourly rate\n* Flexible working hours\n* Annual product allowance\n* Family & friends’ discounts\n\n## About Us\nProudly serving the community since 1982, our family-run practice has built a reputation for quality care and personal service. With over 42 years of combined experience, we’re dedicated to helping our patients look and see their best — every day."
  },
  {
    "id": "51",
    "title": "Full Time Optical Dispenser | Dalby",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Dalby, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/full-time-optical-dispenser-dalby-at-george-matilda-eyecare-4321809437?position=51&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=GJgRf0NS88J99GwrxrhF7w%3D%3D",
    "description": "## Job Overview\n\nLooking for a workplace where your people skills shine? We need a Full-Time Optical Dispenser who knows that great customer service can be both enjoyable and fabulous!\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nJohn Davies Optometrists was established over 50 years ago and has been in Dalby for around 40 years. Our practice focuses on delivering exceptional customer service as well as testing for macular degeneration, glaucoma, cataracts, and diabetic retinopathy."
  },
  {
    "id": "52",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Eastgardens, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318378434?position=52&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=mBOHDSCkND6KAkCBPLwz4g%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "53",
    "title": "OPSM Optometrist - Merimbula",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Merimbula, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/opsm-optometrist-merimbula-at-opsm-4284125227?position=53&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=HmCnpLATV00igMI03pOBxg%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our Merimbula store you will get to work with world class technology including Visual Field Analyser, Non-contact tonometer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "54",
    "title": "Optical Dispenser - Envision Optical",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Miami, Queensland, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-envision-optical-at-provision-eyecare-4289686763?position=54&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=vH4Yvl34PNOwnz4b8GDLUw%3D%3D",
    "description": "## Job Overview\n\n> Full or Part Time - Burleigh Waters, QLD\n\nAre you passionate about using advanced optical technology to give personalised care, and building long-term relationships with patients? At Envision Optical, we’re a proudly independent local practice that combines advanced technology with genuine patient connection. We’re seeking an experienced and enthusiastic Optical Dispenser to join our team at Burleigh Waters and Tweed Heads South.\n\n## What you’ll enjoy at Envision Optical\n* A welcoming, community-focused environment\n* Personalised patient care\n* Advanced technology - Work with the latest Rodenstock BIG Exact premium lens technology\n* Beautiful eyewear collections from brands like Prada, Lindberg, Face a Face, Prodesign, Woodys, and more!\n* Professional growth and a supportive, collaborative team\n\n## About you\n* Qualified Optical Dispenser or significant dispensing experience (min. 2+ years).\n* Skilled in lens selection, frame styling, adjustments, and troubleshooting.\n* Passionate about patient care and building long-term relationships.\n* Strong communication skills with a focus on exceptional patient care.\n* Team-oriented with a positive, professional attitude.\n* Inherently organised with excellent attention to detail\n\n## What we offer\n* Full or Part time hours available: we are flexible for the right applicant\n* Competitive salary package, based on skills and experience.\n* No public holidays or Sundays\n* Professional development opportunities including provided membership of Optical Dispensers Australia.\n* A practice culture that values independence, connection, and quality care."
  },
  {
    "id": "55",
    "title": "Casual Optical Dispenser | Daylesford",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Daylesford, Victoria, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-daylesford-at-george-matilda-eyecare-4335691526?position=55&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=uLtIfPUIRsNQYkJ3HKwBqw%3D%3D",
    "description": "## Job Overview\n\nWe are looking for a Casual Optical Dispenser to work Fridays and Saturdays, who has a knack for making people happy, because who says customer service can't be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nEstablished in 1978, Darryl Wilson Optometrist has over 40 years of experience and operates three successful practices in regional Victoria including Daylesford, Bacchus Marsh & Wendouree. Our qualified Optometrists ensure patients receive the very best eyecare and the team is committed to delivering quality service and stylish eyewear."
  },
  {
    "id": "56",
    "title": "Optical Assistant/Dispenser - Eyecentric",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Griffith, Australian Capital Territory, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-eyecentric-at-provision-eyecare-4319267653?position=56&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=un6xx6UKix1mlAxCtZjQvA%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Manuka, ACT\n\nAre you detail-oriented, customer-focused, and passionate about fashion-forward eyewear? Eyecentric in Manuka, Canberra, is seeking a dedicated Optical Assistant/Dispenser to join our boutique practice.\n\n## About the Role\nThis role offers a unique opportunity to work closely with our optometrists, providing high-quality optical dispensing services while assisting with administrative and clinical support. You’ll enjoy variety in your day - from dispensing and frame styling, to pre-testing, contact lens teaching, and supporting dry eye treatments (full training provided).\n\n## Key Responsibilities\n* Provide expert advice on lens and frame selection to suit patients’ needs\n* Perform dispensing, adjustments, and frame repairs\n* Support optometrists with pre-testing and patient care\n* Assist with contact lens teaching and dry eye treatments\n* Maintain accurate patient records\n* Contribute to merchandising and visual presentation of frames\n* Opportunity to assist with practice social media content\n\n## Who You Are\n* Experienced in optical dispensing or keen to develop your dispensing skills\n* Organised, detail-focused, and reliable\n* Excellent communicator with a warm, patient-first approach\n* Customer service-oriented and professionally presented\n* Team player with a flair for fashion and eyewear styling\n\n## Who We Are\nEyecentric is a family-run, boutique optometry practice in the heart of vibrant Manuka. With a reputation for exceptional patient care and carefully curated eyewear, we offer a supportive, fun workplace that encourages continuous learning, professional growth, and involvement in all aspects of the practice."
  },
  {
    "id": "57",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Elizabeth, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318366815?position=57&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=c2dYSX5zEVdZ9lMvu2E%2BoA%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "58",
    "title": "Optical Dispenser",
    "company": "onepointsevenfour",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEJqJQo5WkRSQ/company-logo_100_100/company-logo_100_100/0/1631315064471?e=2147483647&v=beta&t=bx636MRtreyyr7eO1nye2vSopixzJkmmnK--ohL4IEU",
    "location": "Sydney, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-at-onepointsevenfour-4270909570?position=58&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=0mhPNnavEmOY0xcrwA8bxQ%3D%3D",
    "description": "## Who We Are\n\nAt onepointsevenfour, we curate the world’s most coveted eyewear – a carefully considered edit of luxury frames that celebrate individuality, style, and craftsmanship. Think of us as your eyewear couturier. Our boutique in Paddington Sydney is nestled in the fashion-forward precinct, home to international brands like Thom Browne, Victoria Beckham, Dior, and Jacques Marie Mage.\n\n## Who You Are\nYou’re passionate about frames, fashion and love styling patients. Whether you’re an experienced optical dispenser or a fashion retail professional looking to enter the world of premium eyewear, we’d love to meet you. You are:\n* Impeccably presented, with a flair for fashion and customer service\n* Reliable, self-motivated, and customer-obsessed\n* Experienced (2+ years) in either retail, fashion, or optics\n* Able to communicate clearly and tailor recommendations to individual needs\n* Excited to learn more about eyewear, eye care, and luxury brands\n\n## What You’ll Do\n* Deliver exceptional, one-on-one service to our discerning clientele\n* Guide customers in selecting sunglasses, optical frames, lenses, and accessories\n* Understand lifestyle needs and help clients find eyewear that enhances how they live, work, and feel\n* Represent some of the most prestigious eyewear brands globally\n* Work collaboratively as part of a passionate, experienced team\n* Contribute to the store’s success through product knowledge, service, and sales\n\n## Why Join Us?\nThis is your chance to work in a beautiful, high-end environment surrounded by artful design and fashion. We offer a generous package plus bonus opportunity. We are currently interviewing for this role – full-time or part-time permanent opportunities available."
  },
  {
    "id": "59",
    "title": "Optical Dispenser - Perfect Vision",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Greater Sydney Area",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-perfect-vision-at-george-matilda-eyecare-4312624595?position=59&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=DcymoqoqfKkiJj85RCYgfw%3D%3D",
    "description": "## Job Overview\n\n> Join Sydney CBD’s Leading Optometry Destination!\n\nPerfect Vision is an award-winning optical practice located in the heart of Sydney’s CBD, known for our cutting-edge approach to vision and style. We are seeking an experienced Optical Dispenser (Part Time or full time) to join our team who is available to travel to our sister practice at St Leonard's 2 days a week.\n\n## About The Role\n* Guide patients in selecting frames and lenses suited to their needs\n* Provide expert advice on lens technologies, coatings and vision solutions\n* Basic workshop tasks e.g adjustments, repairs and quality control\n* Administrative duties such as appointment book management, banking, entering stock and reporting\n* Maintain a tidy practice environment to ensure a positive overall patient experience\n\n## Our Benefits\n* Learning and Development opportunities tailored to your goals\n* Team bonus incentives + great discounts across frames and lenses including family and friends\n* Employee Assistance Program available\n* Work with some of the leading bands in the optical industry such as Jacques Marie Mage, Chrome Hearts, Cutler & Gross and Dita.\n\n## About You\n* Available Monday- Friday minimum of 26.5 hours per week.\n* Excellent customer service and communication skills, both in person and over the phone\n* Cert IV dispensing qualification desired but not essential\n* Passion to help others\n* Out of the box thinker to solve complex problems"
  },
  {
    "id": "60",
    "title": "Casual Optical Dispenser - Charlestown Eyecare",
    "company": "Bendigo Advertiser",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQH9cP7y-Qmufg/company-logo_100_100/company-logo_100_100/0/1631388401759?e=2147483647&v=beta&t=Gig16tlvPlETVmQJsrxyiJe05DB5UF14ba76FwWJrQA",
    "location": "Bar Beach, New South Wales, Australia",
    "type": "Other",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-charlestown-eyecare-at-bendigo-advertiser-4322586405?position=60&pageNum=0&refId=cs7ZhQl9jlzRa%2BHVcJvyfg%3D%3D&trackingId=xDqCpIDTOvrmcZnE0oE3Og%3D%3D",
    "description": "## Job Overview\n\nNational Optical Care, are a community of optometry practices that are passionate about empowering eye care excellence. We recently merged with George and Matilda, leveraging the combined expertise of our practice community with strong supplier relationships to deliver the very best in patient care. Charlestown Eyecare has been offering comprehensive optical care to locals and residents for more than 30 years. We are searching for a Casual Dispenser to grow our team.\n\n## About The Role\n* Provide friendly and efficient reception service\n* Assist patients in the selection of optical frames taking into account lifestyle and physical needs\n* Recommend use of ancillary products (e.g. contact lens care products).\n* Support other team members in the achievement of practice goals and objectives including processing payments, entering stock, and stock takes\n* Maintain a high level of housekeeping in the practice\n\n## Our Benefits\n* Learning and development opportunities tailored to your goals\n* Great discounts across frames and lenses including family and friends\n* Employee Assistance Program (EAP)\n* Perks and bonus Programs\n* Work with a great team who are truly invested in their patients\n\n## About You\n* Effective communication and customer service skills\n* Team focused alongside independent work\n* Strong organizational skills and ability to problem solve\n* Positive and energetic attitude\n* Experience in the optical industry is preferred, however for those eager to take on a new career we are willing to develop\n* With no weekend work or late nights"
  },
  {
    "id": "61",
    "title": "Optometrist Metro Adelaide SA - Full Time or Part Time Considered",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Adelaide, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-metro-adelaide-sa-full-time-or-part-time-considered-at-opsm-4320327992?position=1&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=KPsqlyS35XPeM0cIRIXhDQ%3D%3D",
    "description": "## Job Overview\n\n> Optometrist – Permanent Part Time or Full Time Considered| OPSM Metro Adelaide\n\nJoin a leader in eyecare and eyewear. Make a difference across the community with cutting-edge technology at your fingertips. We are looking for a passionate Optometrist with 1 year or more experience to join our permanent metro relief Optometry team. With access to state-of-the-art diagnostic equipment—including WAM700, Zeiss & Revo OCT, UWDRS and Icare to name a few —you’ll have all the tools you need to deliver exceptional care.\n\n## Why Join OPSM?\n* Work with premium diagnostic technology and iconic eyewear brands including Ray-Ban, Oakley, Prada, and more\n* Access to CPD through the Leonardo learning platform\n* Enjoy employee product discounts and annual product allowances\n* Get involved with global volunteering opportunities through OneSight\n* Be part of EssilorLuxottica, the world leader in eyewear and eyecare\n\n## Your Role\n* Perform a wide range of eye exams, including paediatrics, contact lenses, and therapeutics\n* Tailor lens solutions to lifestyle needs\n* Educate patients on lens and diagnostic technologies\n* Collaborate with your retail team and foster a one-team approach\n* Contribute to a patient-first, team-oriented environment"
  },
  {
    "id": "62",
    "title": "Casual Optical Dispenser | McMahons Point",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mcmahons Point, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-mcmahons-point-at-george-matilda-eyecare-4312630389?position=2&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=DFGA%2Fw1e6mSgy9xLyX7jMw%3D%3D",
    "description": "## Job Overview\n\nWe are looking for a Casual Optical Dispenser with a knack for making people happy, because who says customer service can't be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nEstablished in 1992, Michael Angelos moved his Optometric practice from North Point to Greenwood Plaza, and relocated in 2013 to a chic new practice in the beautiful McMahons Point Village – the first-class service continues today."
  },
  {
    "id": "63",
    "title": "Casual Optical Dispenser | Mosman",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mosman, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-mosman-at-george-matilda-eyecare-4311633897?position=3&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=kIoViPRz1INVe7GxvHSoqg%3D%3D",
    "description": "## Job Overview\n\nWe’re on the lookout for a Casual Optical Dispenser who knows how to combine great service with great energy — because who says customer service can’t be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nPeter Hewett Optometrists was established by Peter’s grandfather in 1923. The team focuses on comprehensive eye examinations, prescription sunglasses, spectacle frames, contact lenses, and eye health care for the whole family."
  },
  {
    "id": "64",
    "title": "EyeQ Young/Cootamundra - Permanent Optometrist",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-young-cootamundra-permanent-optometrist-at-eyeq-optometrists-4319275638?position=4&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=3O8oSSv13ciJqSME%2F6sbkQ%3D%3D",
    "description": "## Why EyeQ Young / Cootamundra?\n\n> Join Our Team at EyeQ Young / Cootamundra – Optometrist Opportunity\n\nEyeQ Optometrists Young and Cootamundra are seeking a passionate and community-focused Optometrist to join our friendly and experienced teams in the beautiful Hilltops region of New South Wales. At EyeQ, we take pride in delivering personalised, high-quality eyecare to generations of loyal patients. You’ll enjoy true clinical autonomy, supported by national systems, advanced technology, and a knowledgeable, close-knit retail team.\n\n## What We Offer\n* Competitive salary package\n* Well-established practices with a strong community reputation\n* Loyal patient base and a supportive, experienced team\n* Flexibility – part-time and full-time options available\n* No late nights, Sundays, or extended hours\n* Opportunities for clinical growth, mentoring, and professional development\n* Access to CPD, ongoing education, and national conferences\n\n## What We’re Looking For\n* A qualified and registered Optometrist (new graduates welcome!)\n* A passion for patient-centred care\n* Excellent communication and clinical decision-making skills\n* A team player who values long-term patient relationships"
  },
  {
    "id": "65",
    "title": "Optometrist | Mudgee",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Mudgee, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-mudgee-at-george-matilda-eyecare-4320600547?position=5&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=V6vLJa7qJbqPJukKCaEj0g%3D%3D",
    "description": "## Job Overview\n\n> Make Mudgee Yours\n\nThis is regional optometry at its best – a high standard of care in a beautiful setting. Mudgee is a nationally recognised tourism town with a strong community spirit, award-winning wineries, and stunning scenery. You will be practicing in a spacious, light-filled, and purpose-fitted terrace home in the heart of town.\n\n## About The Role\nThis is a wonderful opportunity for an optometrist to join an established practice and continue our legacy of delivering uncompromising local eyecare. You’ll be managing end-to-end eyecare across a wide patient base, in a practice known for its clinical independence, longstanding community trust, and close ties with local GPs and ophthalmologists.\n\n## About The Practice\n* Centrally located in the heart of Mudgee’s shopping precinct\n* Equipped with advanced diagnostic technology including OCT, Optos widefield imaging, visual fields, and corneal topography\n* 30-minute appointments as standard\n* A friendly and supportive dispensing team who understands your clinical flow\n* Genuine autonomy backed by a national network\n* A multigenerational patient base who value continuity and care\n\n## What We’re Looking For\n* A broad, confident clinical skillset and a desire to keep learning\n* At least 2 years’ post-grad experience\n* The ability to tailor care across a wide patient demographic, from young to young-at-heart\n* Clear, patient-first communication\n* A collaborative mindset with a strong sense of ownership\n* Comfort in practicing independently while contributing to a broader team\n\n## What We Offer\n* Competitive salary + super + CPD/AHPRA/OA allowance\n* Regular Performance Bonuses – earn more, regularly\n* Ongoing education and development opportunities\n* Family and friends discounts + annual product allowance\n* Support to build your clinical interests\n* A chance to make a visible difference in a town that values its healthcare providers"
  },
  {
    "id": "66",
    "title": "Experienced Optical Dispenser - OptoMed",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Norwood, South Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/experienced-optical-dispenser-optomed-at-provision-eyecare-4318331561?position=6&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=jh6uW54y3g0UX3I%2FcDg37A%3D%3D",
    "description": "## Job Overview\n\n> Part Time and/or Full Time available - Norwood, SA\n\nOptoMed is a boutique optometry practice in Norwood known for its personalised care, curated eyewear, and attention to detail. We’re looking for an experienced Optical Dispenser who takes pride in delivering a world-class patient experience.\n\n## The Role\nYou’ll work closely with the Optometrist as the key point of contact for patients - guiding them from booking to eyewear collection. It’s a hands-on role where you’ll manage everything front-of-house, from helping clients choose frames to processing lens orders.\n\n## You’ll\n* Dispense premium eyewear, including Hoya and Essilor lenses\n* Manage bookings, calls, and administrative tasks\n* Deliver genuine, detailed care to every patient\n* Represent boutique brands with confidence and style\n\n## About You\nYou’re an experienced dispenser (2+ years) who’s as comfortable adjusting frames as you are making patients feel at ease. You’re proactive, articulate, and genuinely interested in building lasting relationships. You’ll thrive here if you:\n* Have a passion for eyewear, aesthetics, and detail\n* Enjoy taking initiative and finding solutions\n* Are reliable, approachable, and genuinely care about people\n* Want to keep learning and contributing to a business that values excellence\n\n## Why You’ll Love It\n* Boutique, high-quality practice with a warm, professional team\n* Work with premium eyewear and lens brands\n* Ongoing learning and career growth in a forward-thinking business\n* Competitive hourly rate $30–$35/hr + bonuses, depending on experience"
  },
  {
    "id": "67",
    "title": "OPSM Optometrist - Belconnen",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Belconnen, Australian Capital Territory, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/opsm-optometrist-belconnen-at-opsm-4320313808?position=7&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=LKPsaU4%2BNZqXmS3rypDGeg%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our Belconnen store you will get to work with world class technology including Retinal Camera, Visual Field Analyser, Non-contact tonometer, Corneal Topographer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "68",
    "title": "Optometrist Casual Gold Coast 1",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Springwood, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-casual-gold-coast-1-at-opsm-4262364060?position=8&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=spe9i8jZIj5zR%2F4Ts1309w%3D%3D",
    "description": "## Job Overview\n\nAt OPSM we are obsessed with eye care and offering our patients the confidence in how they see their world. As a leading eye care and eyewear retailer, we have been looking after the eyes of Australians and New Zealanders for over 93 years. We are not your typical retail business.\n\nWe use the most cutting-edge products and technologies, and collaborate with an amazing collective of knowledgeable and experienced Optical professionals. As an Optometrist with us, you will get to work with world class technology including CLARIFYE, WAM800, OCT (with Biometry), IPL, the Optos Next Generation.\n\nCurrently, we have a position available on our Casual Gold Coast Optometry Relief Team for a recent graduate or experienced optometrist to join our team. This position would suit an optometrist that likes variety and enjoys working in well equipped practices alongside experienced and supportive optometrists and dispensing teams.\n\nAt OPSM we can offer you an opportunity to make a real difference in the way people see the world. You will be able to access many opportunities for continuing professional development through financially supported industry training, peer learning communities and product training. We offer competitive salaries and incentives, a generous product allowance, and lots of other great benefits too."
  },
  {
    "id": "69",
    "title": "Optical Assistant/Dispenser - Bright Eyes Optics",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Mona Vale, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-bright-eyes-optics-at-provision-eyecare-4293514877?position=9&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=qg2ErW0w7lcaTbWxApB2ng%3D%3D",
    "description": "## Job Overview\n\n> Part Time/Casual - Mona Vale, NSW\n\nAre you passionate about people, love a good chat, and keen to grow in a dynamic and supportive environment? Bright Eyes Optics, a newly opened independent optometry practice in Mona Vale, is looking for a reliable and enthusiastic Optical Assistant or Dispenser to join our growing team!\n\n## Why Join Us?\n* Be part of an exciting new chapter in a fresh, modern practice\n* Flexibility - part time, or casual options available (days to be discussed)\n* Work closely with a small, supportive team where your ideas and energy make a difference\n* Develop your skills with varied responsibilities and opportunities to grow\n\n## About The Role\nYour key responsibilities will include:\n* Greeting and engaging with patients in a warm and professional manner\n* Assisting patients in selecting frames and lens options to suit their needs and style\n* Providing tailored advice on lens features and benefits\n* Handling sales transactions and appointment bookings\n* Keeping the space clean, tidy, and welcoming\n\n## We’d Love to Hear from You if You\n* Have a background in customer service (optical or retail experience is a bonus!)\n* Are approachable, adaptable, and keen to learn\n* Can communicate clearly and confidently with a wide range of people\n* Take initiative and enjoy being part of a close-knit team\n* Are reliable and motivated to build a role in the optical industry\n\n## What We Offer\n* A competitive hourly rate ($28 - $40/hr depending on experience)\n* Flexibility - part time and casual options available, with days to be discussed\n* A positive, down-to-earth work culture\n* On the job training and support to develop your skills\n* Staff discounts and opportunities for growth as the practice expands"
  },
  {
    "id": "70",
    "title": "Vision Therapist - Bassendean Optical",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Ashfield, Western Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/vision-therapist-bassendean-optical-at-provision-eyecare-4321125785?position=10&pageNum=2&refId=tFH1tTuBDIi9HJF3WC3Kcg%3D%3D&trackingId=pXfV2C%2FMm%2Fb1ESYpoAw8mQ%3D%3D",
    "description": "## Job Overview\n\n> Part or Full Time - Bassendean, WA\n\nMake a real difference to patients’ lives through specialised vision care. Bassendean Optical, an independent practice with a focus on children’s vision and neuro-visual rehabilitation, is seeking a Vision Therapist to join our skilled and supportive team.\n\n## About The Role\nAs a Vision Therapist, you’ll deliver tailored therapy programs to patients with:\n* Visual difficulties in children (e.g., lazy eye, eye-turn, learning-related vision issues)\n* Neurological conditions, including stroke, concussion, or brain injury\n\nThis position could also suit an Optical Dispenser or Optical Assistant looking to expand their clinical expertise, with full training and mentorship provided.\n\n## About You\nYou’ll be a strong candidate if you are:\n* Patient-focused and empathetic, with excellent communication skills\n* Confident working with children and adults with complex visual needs\n* Flexible, adaptable, and able to problem-solve in real-time\n* Motivated to learn and grow within a specialist clinical role\n\n## Why Join Us?\n* Work in a modern, well-equipped practice with a collaborative, supportive culture\n* Opportunity for specialist clinical development and formal vision therapy training\n* Make a tangible difference to patients’ visual function and quality of life\n* Hours: Part or Full time (with flexibility)"
  },
  {
    "id": "71",
    "title": "Full Time Optical Dispenser | Dalby",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Dalby, Queensland, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/full-time-optical-dispenser-dalby-at-george-matilda-eyecare-4321809437?position=1&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=6evTwKpncHMzJ3OlWMHQ1w%3D%3D",
    "description": "## Job Overview\n\nLooking for a workplace where your people skills shine? We need a Full-Time Optical Dispenser who knows that great customer service can be both enjoyable and fabulous!\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nJohn Davies Optometrists was established over 50 years ago and has been in Dalby for around 40 years. Our practice focuses on delivering exceptional customer service as well as testing for macular degeneration, glaucoma, cataracts, and diabetic retinopathy."
  },
  {
    "id": "72",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Eastgardens, New South Wales, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318378434?position=2&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=ACAAj0OqT0%2BzZDhUAJ2VqA%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "73",
    "title": "OPSM Optometrist - Merimbula",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Merimbula, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/opsm-optometrist-merimbula-at-opsm-4284125227?position=3&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=pVxEcSR01l7DoBvOPJpqhA%3D%3D",
    "description": "## About Us\n\nWe are EssilorLuxottica, a global leader in the design, manufacture and distribution of ophthalmic lenses, frames and sunglasses. At OPSM, we are a leading eyecare and eyewear retailer in Australia and New Zealand with more than 80 years of history. Our aim is to raise the standard of eye health and eyecare, using our world-class technology.\n\n## Your Opportunity\nAs an Optometrist in our Merimbula store you will get to work with world class technology including Visual Field Analyser, Non-contact tonometer, Optos UWDRS and OCT. You will also understand the lives behind the eyes and identify how OPSM can help maximise a customer’s lifestyle enjoyment factor with appropriate eyecare, while providing the highest level of tailored customer service.\n\n## Your Responsibilities\n* Perform eye examinations for a broad range and scope of customers by taking on different types of appointments e.g. kids, contact lenses, therapeutics etc.\n* Confidently recommend lens solutions based on customer lifestyles\n* Clearly explain lens technology, communicating the features and benefits of lens products to customers including coatings and extras\n* Coach and mentor Graduate Optometrists in the usage and recommendation of technology to customers\n* Work with the Store Manager and Managing Optometrists to maximise Eyecare revenue, including but not limited to technology, Optometry labour efficiencies and appropriate Medicare billing\n\n## Culture & Benefits\nWe are the leader in eyewear and eyecare around the world and are proud of our iconic brands, premium products and services. By Joining Us, You Will Enjoy The Following Benefits:\n* Diverse career progression opportunities to grow, develop and specialise in areas of interest\n* Access to Luxottica's Institute of Professional Development including fellowship programs and post-graduate scholarships\n* An in-depth graduate pathway program supported by a local mentor and team\n* Local and global volunteering opportunities through our charity partner, OneSight\n* A yearly product allowance and product discounts to treat yourself, family and friends"
  },
  {
    "id": "74",
    "title": "Optical Dispenser - Envision Optical",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Miami, Queensland, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-envision-optical-at-provision-eyecare-4289686763?position=4&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=HFEVIbtIEskPU7GIF36L5A%3D%3D",
    "description": "## Job Overview\n\n> Full or Part Time - Burleigh Waters, QLD\n\nAre you passionate about using advanced optical technology to give personalised care, and building long-term relationships with patients? At Envision Optical, we’re a proudly independent local practice that combines advanced technology with genuine patient connection. We’re seeking an experienced and enthusiastic Optical Dispenser to join our team at Burleigh Waters and Tweed Heads South.\n\n## What you’ll enjoy at Envision Optical\n* A welcoming, community-focused environment\n* Personalised patient care\n* Advanced technology - Work with the latest Rodenstock BIG Exact premium lens technology\n* Beautiful eyewear collections from brands like Prada, Lindberg, Face a Face, Prodesign, Woodys, and more!\n* Professional growth and a supportive, collaborative team\n\n## About you\n* Qualified Optical Dispenser or significant dispensing experience (min. 2+ years).\n* Skilled in lens selection, frame styling, adjustments, and troubleshooting.\n* Passionate about patient care and building long-term relationships.\n* Strong communication skills with a focus on exceptional patient care.\n* Team-oriented with a positive, professional attitude.\n* Inherently organised with excellent attention to detail\n\n## What we offer\n* Full or Part time hours available: we are flexible for the right applicant\n* Competitive salary package, based on skills and experience.\n* No public holidays or Sundays\n* Professional development opportunities including provided membership of Optical Dispensers Australia.\n* A practice culture that values independence, connection, and quality care."
  },
  {
    "id": "75",
    "title": "Casual Optical Dispenser | Daylesford",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Daylesford, Victoria, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-daylesford-at-george-matilda-eyecare-4335691526?position=5&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=9je8RMyh5hUW846FtvUDcA%3D%3D",
    "description": "## Job Overview\n\nWe are looking for a Casual Optical Dispenser to work Fridays and Saturdays, who has a knack for making people happy, because who says customer service can't be fun and fabulous?\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work to suit our fluctuating business needs, including weekends, public holidays and late trade\n\n## Benefits And Perks\nAt G&M Eyecare we are determined to hire the best people and give them the freedom and flexibility to look after patients at the local level. We offer a down-to-earth and friendly working environment with mentoring and support. Also, on offer is:\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nEstablished in 1978, Darryl Wilson Optometrist has over 40 years of experience and operates three successful practices in regional Victoria including Daylesford, Bacchus Marsh & Wendouree. Our qualified Optometrists ensure patients receive the very best eyecare and the team is committed to delivering quality service and stylish eyewear."
  },
  {
    "id": "76",
    "title": "Optical Assistant/Dispenser - Eyecentric",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Griffith, Australian Capital Territory, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-assistant-dispenser-eyecentric-at-provision-eyecare-4319267653?position=6&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=1C%2FhO6Pk0E6sbbl7ityKgQ%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Manuka, ACT\n\nAre you detail-oriented, customer-focused, and passionate about fashion-forward eyewear? Eyecentric in Manuka, Canberra, is seeking a dedicated Optical Assistant/Dispenser to join our boutique practice.\n\n## About the Role\nThis role offers a unique opportunity to work closely with our optometrists, providing high-quality optical dispensing services while assisting with administrative and clinical support. You’ll enjoy variety in your day - from dispensing and frame styling, to pre-testing, contact lens teaching, and supporting dry eye treatments (full training provided).\n\n## Key Responsibilities\n* Provide expert advice on lens and frame selection to suit patients’ needs\n* Perform dispensing, adjustments, and frame repairs\n* Support optometrists with pre-testing and patient care\n* Assist with contact lens teaching and dry eye treatments\n* Maintain accurate patient records\n* Contribute to merchandising and visual presentation of frames\n* Opportunity to assist with practice social media content\n\n## Who You Are\n* Experienced in optical dispensing or keen to develop your dispensing skills\n* Organised, detail-focused, and reliable\n* Excellent communicator with a warm, patient-first approach\n* Customer service-oriented and professionally presented\n* Team player with a flair for fashion and eyewear styling\n\n## Who We Are\nEyecentric is a family-run, boutique optometry practice in the heart of vibrant Manuka. With a reputation for exceptional patient care and carefully curated eyewear, we offer a supportive, fun workplace that encourages continuous learning, professional growth, and involvement in all aspects of the practice."
  },
  {
    "id": "77",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Elizabeth, South Australia, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318366815?position=7&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=j%2FVtk9ETITJKqojSVErK8Q%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "78",
    "title": "Optical Dispenser",
    "company": "onepointsevenfour",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEJqJQo5WkRSQ/company-logo_100_100/company-logo_100_100/0/1631315064471?e=2147483647&v=beta&t=bx636MRtreyyr7eO1nye2vSopixzJkmmnK--ohL4IEU",
    "location": "Sydney, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-at-onepointsevenfour-4270909570?position=8&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=Jhlw3kHj%2BIcD9Q%2F8rRQ4fw%3D%3D",
    "description": "## Who We Are\n\nAt onepointsevenfour, we curate the world’s most coveted eyewear – a carefully considered edit of luxury frames that celebrate individuality, style, and craftsmanship. Think of us as your eyewear couturier. Our boutique in Paddington Sydney is nestled in the fashion-forward precinct, home to international brands like Thom Browne, Victoria Beckham, Dior, and Jacques Marie Mage.\n\n## Who You Are\nYou’re passionate about frames, fashion and love styling patients. Whether you’re an experienced optical dispenser or a fashion retail professional looking to enter the world of premium eyewear, we’d love to meet you. You are:\n* Impeccably presented, with a flair for fashion and customer service\n* Reliable, self-motivated, and customer-obsessed\n* Experienced (2+ years) in either retail, fashion, or optics\n* Able to communicate clearly and tailor recommendations to individual needs\n* Excited to learn more about eyewear, eye care, and luxury brands\n\n## What You’ll Do\n* Deliver exceptional, one-on-one service to our discerning clientele\n* Guide customers in selecting sunglasses, optical frames, lenses, and accessories\n* Understand lifestyle needs and help clients find eyewear that enhances how they live, work, and feel\n* Represent some of the most prestigious eyewear brands globally\n* Work collaboratively as part of a passionate, experienced team\n* Contribute to the store’s success through product knowledge, service, and sales\n\n## Why Join Us?\nThis is your chance to work in a beautiful, high-end environment surrounded by artful design and fashion. We offer a generous package plus bonus opportunity. We are currently interviewing for this role – full-time or part-time permanent opportunities available."
  },
  {
    "id": "79",
    "title": "Optical Dispenser - Perfect Vision",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Greater Sydney Area",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-perfect-vision-at-george-matilda-eyecare-4312624595?position=9&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=c0zOfOfFuR6OFcMrtC2sEA%3D%3D",
    "description": "## Job Overview\n\n> Join Sydney CBD’s Leading Optometry Destination!\n\nPerfect Vision is an award-winning optical practice located in the heart of Sydney’s CBD, known for our cutting-edge approach to vision and style. We are seeking an experienced Optical Dispenser (Part Time or full time) to join our team who is available to travel to our sister practice at St Leonard's 2 days a week.\n\n## About The Role\n* Guide patients in selecting frames and lenses suited to their needs\n* Provide expert advice on lens technologies, coatings and vision solutions\n* Basic workshop tasks e.g adjustments, repairs and quality control\n* Administrative duties such as appointment book management, banking, entering stock and reporting\n* Maintain a tidy practice environment to ensure a positive overall patient experience\n\n## Our Benefits\n* Learning and Development opportunities tailored to your goals\n* Team bonus incentives + great discounts across frames and lenses including family and friends\n* Employee Assistance Program available\n* Work with some of the leading bands in the optical industry such as Jacques Marie Mage, Chrome Hearts, Cutler & Gross and Dita.\n\n## About You\n* Available Monday- Friday minimum of 26.5 hours per week.\n* Excellent customer service and communication skills, both in person and over the phone\n* Cert IV dispensing qualification desired but not essential\n* Passion to help others\n* Out of the box thinker to solve complex problems"
  },
  {
    "id": "80",
    "title": "Casual Optical Dispenser - Charlestown Eyecare",
    "company": "Bendigo Advertiser",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQH9cP7y-Qmufg/company-logo_100_100/company-logo_100_100/0/1631388401759?e=2147483647&v=beta&t=Gig16tlvPlETVmQJsrxyiJe05DB5UF14ba76FwWJrQA",
    "location": "Bar Beach, New South Wales, Australia",
    "type": "Other",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-charlestown-eyecare-at-bendigo-advertiser-4322586405?position=10&pageNum=5&refId=F4E%2BxR2bG%2FvC2M6MD6ewuA%3D%3D&trackingId=EdaeDkqeOqdQG5qfz2ZmjQ%3D%3D",
    "description": "## Job Overview\n\nNational Optical Care, are a community of optometry practices that are passionate about empowering eye care excellence. We recently merged with George and Matilda, leveraging the combined expertise of our practice community with strong supplier relationships to deliver the very best in patient care. Charlestown Eyecare has been offering comprehensive optical care to locals and residents for more than 30 years. We are searching for a Casual Dispenser to grow our team.\n\n## About The Role\n* Provide friendly and efficient reception service\n* Assist patients in the selection of optical frames taking into account lifestyle and physical needs\n* Recommend use of ancillary products (e.g. contact lens care products).\n* Support other team members in the achievement of practice goals and objectives including processing payments, entering stock, and stock takes\n* Maintain a high level of housekeeping in the practice\n\n## Our Benefits\n* Learning and development opportunities tailored to your goals\n* Great discounts across frames and lenses including family and friends\n* Employee Assistance Program (EAP)\n* Perks and bonus Programs\n* Work with a great team who are truly invested in their patients\n\n## About You\n* Effective communication and customer service skills\n* Team focused alongside independent work\n* Strong organizational skills and ability to problem solve\n* Positive and energetic attitude\n* Experience in the optical industry is preferred, however for those eager to take on a new career we are willing to develop\n* With no weekend work or late nights"
  },
  {
    "id": "81",
    "title": "EyeQ Lithgow - Permanent Optometrist",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-lithgow-permanent-optometrist-at-eyeq-optometrists-4319166753?position=1&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=BAhd4KdGAiY9mqW8FcAmzw%3D%3D",
    "description": "## Why EyeQ Lithgow?\n\n> Join Our Team at EyeQ Lithgow – Optometrist Opportunity\n\nEyeQ Optometrists Lithgow is looking for a passionate and community-minded Optometrist to join our dedicated team in the beautiful Blue Mountains region. At EyeQ Lithgow, we pride ourselves on delivering personalised, high-quality eyecare to a loyal patient base. As a part of the EyeQ group, you’ll enjoy clinical autonomy while being supported by national systems, innovative technology, and a knowledgeable retail team.\n\n## What We Offer\n* A well-established practice with a strong local reputation\n* Loyal patient base and a supportive, experienced team\n* Flexibility – part-time and full-time options considered\n* No late nights, Sundays, or extended hours\n* Opportunity to grow your clinical skills in a supportive environment\n* Access to CPD, mentoring, and national conferences\n\n## What We’re Looking For\n* A qualified and registered Optometrist (new graduates welcome!)\n* A commitment to patient-focused care\n* Excellent communication and clinical decision-making skills\n* A team player who values long-term patient relationships"
  },
  {
    "id": "82",
    "title": "Optical Dispenser/Assistant - Eyes on Docklands",
    "company": "ProVision Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQGC-rXMiF6O4Q/company-logo_100_100/company-logo_100_100/0/1632786419753/provision_eyecare_logo?e=2147483647&v=beta&t=J5rd1uMgS60XMzsRCFQv3QLYxpHqlaJjtBIPqcTrhcE",
    "location": "Docklands, Victoria, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optical-dispenser-assistant-eyes-on-docklands-at-provision-eyecare-4320831043?position=2&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=vnS4Ixe1zhQJR6Y%2BXUX8jQ%3D%3D",
    "description": "## Job Overview\n\n> Part Time - Docklands, VIC | 1-3 days per week | Monday to Friday | No Weekends or Late Nights\n\nAre you an experienced optical or health professional seeking a role that values both skill and balance? Eyes on Docklands is looking for a part-time Optical Dispenser / Assistant to join our independent, community-focused practice.\n\n## About The Role\nYou’ll work closely with our optometrist and patients to ensure a seamless experience - from welcoming them at reception to assisting with eyewear selection and providing quality dispensing advice. Your key responsibilities will include:\n* Providing outstanding customer service at the front desk\n* Managing bookings, phone enquiries, and general administration\n* Assisting patients with frame and lens selection\n* Supporting the optometrist and wider team in daily operations\n\n## About You\nWe’re looking for someone who brings both professionalism and warmth to their work. You’ll have:\n* At least 5 years’ experience in the optical or broader health industry\n* Excellent communication and organisational skills\n* A friendly, adaptable approach and genuine care for patients\n* Confidence in handling both dispensing and administrative duties\n\n## Why You’ll Love Working with Us\n* Monday to Friday role – no weekends or late nights\n* Flexible hours to suit your lifestyle (1-3 days per week)\n* Independent practice with a loyal patient base and a supportive team\n* Hands-on, ongoing training to continue developing your optical expertise"
  },
  {
    "id": "83",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Southport, Queensland, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318366820?position=3&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=rg2ewcV7ELG783FGtHc9uQ%3D%3D",
    "description": "## Job Overview\n\n> Stay on trend with a free pair of prescription glasses every six months!\n\nWe are seeking a qualified and AHPRA-registered Optometrist to join our globally expanding network of optometry services. Part-time opportunity available to cover Saturdays and Sundays. Joint Venture Partnership opportunities and relocation support are also available.\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. We're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "84",
    "title": "Optometrist",
    "company": "Oscar Wylee",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVkJn1gpybPg/company-logo_100_100/company-logo_100_100/0/1631314664078?e=2147483647&v=beta&t=FLZ2iowVEbNssucUaJ_uGCRjpeiX2N64GTL6rL5at_w",
    "location": "Sunshine Coast, Queensland, Australia",
    "type": "Part-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/optometrist-at-oscar-wylee-4318377535?position=4&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=NGHg5lSxwxcuVwGvqxuhiQ%3D%3D",
    "description": "## Job Overview\n\n> Receive 2 x free prescription eyewear per calendar year to keep you on trend!\n\nOscar Wylee is a leading optometry company with 130+ stores located in Australia, New Zealand and Canada, employing 1000+ worldwide. We are committed to delivering exceptional patient care along with providing an affordable, unique and fashionable product to all.\n\n## About The Opportunity\nWe have a great opportunity for a qualified and AHPRA registered Optometrist to join our service on a permanent part time basis. Preferred days of work are: Monday, Thursday, Friday and Sunday.\n\nWe're looking for professionals capable of delivering a leading practice testing experience and effective eye care and recommendations to patients of diverse demographics.\n\nOur Optometrists succeed when the whole team succeeds. Therefore, it is important that you are able to build meaningful relationships with others and collaborate effectively to ensure a positive and friendly patient experience.\n\nEqually, it is important our Optometrists are supported so we routinely invest in our team members with ACOD traineeships and other training and development activities. We also offer Joint Venture Partnership opportunities and relocations to achieve your personal and financial goals."
  },
  {
    "id": "85",
    "title": "EyeQ Nowra - Permanent Optometrist",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-nowra-permanent-optometrist-at-eyeq-optometrists-4319315761?position=5&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=6USbT8VwyLc3L90zSArwAg%3D%3D",
    "description": "## Why EyeQ Nowra?\n\n> Join Our Team at EyeQ Nowra – Optometrist Opportunity\n\nEyeQ Optometrists Nowra is looking for a passionate and community-minded Optometrist to join our friendly and experienced team on the stunning South Coast of New South Wales. At EyeQ Nowra, we pride ourselves on providing high-quality, personalised eyecare to a loyal and diverse patient base. You’ll enjoy genuine clinical autonomy while being supported by a well-established team, modern technology, and the strength of the EyeQ network.\n\n## What We Offer\n* Competitive salary package\n* Well-established practices with a strong community reputation\n* Loyal patient base and a supportive, experienced team\n* Flexibility – part-time and full-time options available\n* No late nights, Sundays, or extended hours\n* Opportunities for clinical growth, mentoring, and professional development\n* Access to CPD, ongoing education, and national conferences\n\n## What We’re Looking For\n* A qualified and registered Optometrist (new graduates welcome!)\n* A passion for delivering exceptional, patient-focused care\n* Strong communication and clinical decision-making skills\n* A collaborative team player who builds lasting patient relationships"
  },
  {
    "id": "86",
    "title": "EyeQ Optometrsts - Permanent Optometrist Nowra",
    "company": "EyeQ Optometrists",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG7S7InX_AuHg/company-logo_100_100/company-logo_100_100/0/1631341018657?e=2147483647&v=beta&t=MNmSkuH0lHowVdYK2YtWpQSWVzWP_fIXXG1oyjFkr8s",
    "location": "Nowra, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/eyeq-optometrsts-permanent-optometrist-nowra-at-eyeq-optometrists-4319306356?position=6&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=%2B8gkGyJg29jS1rLpxFE02g%3D%3D",
    "description": "## Job Overview\n\n> EyeQ– Nowra Full-Time or Part-Time Optometrist\n\nAt EyeQ, we are all about our people who deliver exceptional customer experiences. It is our passion to provide customers with a personalised approach to eye care, developing long-lasting relationships. Fundamentally, we believe that people deserve quality time with their Optometrist; something we like to call Humanised Optometry.\n\nIf you share these values, EyeQ has an Optometry position available in our Lithgow. The practice is well-equipped, including OPTOS Daytona retinal imaging and OCT.\n\nYou will play a pivotal role in building loyal and trusting relationships with the community to grow the practice. Our patients are great country people, and appreciate an optometrist with enthusiasm, great clinical skills, and a warm heart! You will be able to access many opportunities for continuing professional development, scholarships, competitive salaries and incentives, and a generous product allowance."
  },
  {
    "id": "87",
    "title": "Casual Optometrist Metro Adelaide SA",
    "company": "OPSM",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEXEodfuF512g/company-logo_100_100/company-logo_100_100/0/1678149617535/opsm_pty_limited_logo?e=2147483647&v=beta&t=-twxCuAwy--dIqAC4SOn-b_QXquaIGXZHVFwKGyvjLU",
    "location": "Adelaide, South Australia, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optometrist-metro-adelaide-sa-at-opsm-4316616050?position=7&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=JqOVuzpltbwr1ywstLjV%2Bw%3D%3D",
    "description": "## Job Overview\n\n> Optometrist – Casual | OPSM Metro Adelaide\n\nJoin a leader in eyecare and eyewear. Make a difference across the community with cutting-edge technology at your fingertips. We are looking for a passionate Optometrist with 1 year or more experience to join our casual Optometry team. With access to state-of-the-art diagnostic equipment—including WAM700, Zeiss & Revo OCT, UWDRS and Icare to name a few —you’ll have all the tools you need to deliver exceptional care.\n\n## Why Join OPSM?\n* Work with premium diagnostic technology and iconic eyewear brands including Ray-Ban, Oakley, Prada, and more\n* Access to CPD through the Leonardo learning platform\n* Enjoy employee product discounts and annual product allowances\n* Get involved with global volunteering opportunities through OneSight\n* Be part of EssilorLuxottica, the world leader in eyewear and eyecare\n\n## Your Role\n* Perform a wide range of eye exams, including paediatrics, contact lenses, and therapeutics\n* Tailor lens solutions to lifestyle needs\n* Educate patients on lens and diagnostic technologies\n* Collaborate with your retail team and foster a one-team approach\n* Contribute to a patient-first, team-oriented environment"
  },
  {
    "id": "88",
    "title": "Casual Optical Dispenser | Double Bay",
    "company": "George & Matilda Eyecare",
    "logo": "https://media.licdn.com/dms/image/v2/C510BAQH6VA-GMl4fHw/company-logo_100_100/company-logo_100_100/0/1631310033305?e=2147483647&v=beta&t=4l19UdrV7sIJsZFZeyKHy8FIE7rGs-m51vy0fLEcAy4",
    "location": "Double Bay, New South Wales, Australia",
    "type": "Full-time",
    "applyUrl": "https://au.linkedin.com/jobs/view/casual-optical-dispenser-double-bay-at-george-matilda-eyecare-4319237633?position=8&pageNum=7&refId=kcYmI5e0LUnCKXXJ8A5Q7A%3D%3D&trackingId=IhNB8Rm2xumWUcGJ6AENpA%3D%3D",
    "description": "## Job Overview\n\nWork with stylish eyewear in Double Bay! Join as a Casual Optical Dispenser role with flexible hours and a friendly, welcoming team.\n\n## Skills And Experience\nIf you are someone who loves to provide an amazing patient experience by communicating clearly with patients in a bright, friendly manner, then this role may be for you. We are searching for someone with the following skills:\n* Passionate about Patient care and customer service\n* Preferably has strong retail experience\n* Ability to quickly develop great product knowledge and be confident to share this with our Patients\n* A friendly team player with patience, energy, enthusiasm and passion\n* Able to be flexible with your hours of work, must be available Friday & Saturday\n\n## Benefits And Perks\n* On the job training with an experienced and friendly manager!\n* Annual product allowance\n* Attractive hourly rate\n* Flexible working hours\n* Family and friends' discounts and benefits and more.\n\n## About The Business\nOptique has been providing exceptional eye care and the very best in designer eyewear to our community for nearly 50 years. Our reputation is built on a foundation of clinical excellence, a curated collection of premium eyewear, and superior customer service. We are a fully equipped practice offering comprehensive eye health assessments, including advanced diagnostic imaging with OCT and OPTOS Wide-Field Imaging."
  },
  
